Repository: ayumin/open-cobol
Catalog: branches/gnu-cobol-cpp/po/*.po
Languages: es

source: LOCAL-STORAGE not allowed in nested programs
es: LOCAL-STORAGE no permitido en programas anidados

source: REPORT SECTION not implemented
es: REPORT SECTION no implementada

source: GLOBAL is not allowed with RD
es: GLOBAL no se permite con RD

source: Invalid PAGE clause
es: Inválida cláusula de PAGE

source: INITIAL specified on non-input field
es: INITIAL especificado en campo no de entrada

source: GLOBAL is not allowed with screen items
es: GLOBAL no se permite con elemento de pantalla

source: Executable program requested but PROCEDURE/ENTRY has USING clause
es: Programa executable requerido pero PROCEDURE/ENTRY tiene cláusula USING

source: Number of parameters exceeds maximum %d
es: Numero de parametros excede el maximo %d

source: BY VALUE not allowed in CHAINED program
es: BY VALUE no es permitido en programa CHAINED

source: SIZE only allowed for BY VALUE items
es: SIZE solamente permitido para elementos BY VALUE

source: Invalid value for SIZE
es: Valor inválido para SIZE

source: OPTIONAL only allowed for BY REFERENCE items
es: OPTIONAL solo permitido para elementos BY REFERENCE

source: RETURNING clause is required for a FUNCTION
es: Cláusula RETURNING es requerida para una FUNCTION

source: Unknown statement '%s'
es: Declaración desconocida '%s'

source: SECTION segment invalid within DECLARATIVE
es: Segmento SECTION inválido dentro DECLARATIVE

source: Ignoring CONVERSION
es: Ignorando CONVERSION

source: ALLOCATE CHARACTERS requires RETURNING clause
es: ALLOCATE CHARACTERS requiere cláusula RETURNING

source: Recursive program call - assuming RECURSIVE attribute
es: Recursiva programa, llame al - asumiendo atributo RECURSIVO

source: Invalid mnemonic name
es: Nombre mnemotécnico inválido

source: OMITTED only allowed with BY REFERENCE
es: OMITTED solo permitido con BY REFERENCE

source: Invalid file name reference
es: Referencia inválida a nombre de archivo

source: BY CONTENT assumed for alphanumeric item
es: BY CONTENT asumido para elementos alfanuméricos

source: BY CONTENT not allowed in CHAINED program
es: BY CONTENT no es permitido en programa CHAINED

source: RETURNING item must have level 01 or 77
es: Elemento RETURNING debe de tener un nivel 01 o 77

source: RETURNING item is neither in LINKAGE SECTION nor is it BASED
es: Elemento RETURNING no se encuentra en LINKAGE SECTION ni es BASED

source: ENTRY is invalid in nested program
es: ENTRY es inválido en programas anidados

source: Invalid THROUGH usage
es: Uso inválido de THROUGH

source: EXIT PROGRAM is not allowed within a USE GLOBAL procedure
es: EXIT PROGRAM no es permitido dentro de procedimiento de USE GLOBAL

source: EXIT PROGRAM only allowed within a PROGRAM type
es: EXIT PROGRAM solamente permitido dentro de un tipo de PROGRAM

source: EXIT FUNCTION is not allowed within a USE GLOBAL procedure
es: EXIT FUNCTION no es permitido dentro de procedimiento de USE GLOBAL

source: EXIT FUNCTION only allowed within a FUNCTION type
es: EXIT FUNCTION es solamente permitido dentro de tipo de FUNCTION

source: EXIT PERFORM is only valid with inline PERFORM
es: EXIT PERFORM es solamente válido con PERFORM en línea

source: EXIT SECTION is only valid with an active SECTION
es: EXIT SECTION es solamente válido dentro de SECTION activo

source: EXIT PARAGRAPH is only valid with an active PARAGRAPH
es: EXIT PARAGRAPH es solamente válido dentro de PARAGRAPH activo

source: INSPECT missing a keyword
es: INSPECT le falta una palabra clave

source: SHARING and LOCK clauses are mutually exclusive
es: Cláusulas SHARING y LOCK son mutuamente excluyentes

source: LOCK clause invalid with file LOCK AUTOMATIC
es: Cláusula de LOCK inválida con archivo LOCK AUTOMATIC

source: KEY clause invalid with this file type
es: Cláusula de KEY inválida con este tipo de archivo

source: INVALID KEY clause invalid with this file type
es: Cláusula de INVALID KEY inválida con este tipo de archivo

source: File sort requires KEY phrase
es: Archivo de ordenar requiere frase KEY

source: Table sort without keys not implemented yet
es: Ordenar tabla sin claves no ha sido implementado aún

source: File sort requires USING or INPUT PROCEDURE
es: Archivo de ordenar requiere USING o INPUT PROCEDURE

source: USING invalid with table SORT
es: USING inválido con tabla de SORT

source: INPUT PROCEDURE invalid with table SORT
es: INPUT PROCEDURE inválido con tabla de SORT

source: File sort requires GIVING or OUTPUT PROCEDURE
es: Archivo de ordenar requiere GIVING o OUTPUT PROCEDURE

source: GIVING invalid with table SORT
es: Procedimiento de GIVING inválido con tabla de SORT

source: OUTPUT PROCEDURE invalid with table SORT
es: OUTPUT PROCEDURE inválido con tabla de SORT

source: SIZE/LENGTH invalid here
es: SIZE/LENGTH inválido aquí

source: SUPPRESS statement must be within DECLARATIVES
es: Declaración de SUPPRESS debe de ser dentro de DECLARATIVES

source: UNLOCK invalid for SORT files
es: UNLOCK inválido en archivos SORT

source: USE statement must be within DECLARATIVES
es: Declaraciób de USE debe de ser dentro de DECLARATIVES

source: SECTION header missing before USE statement
es: Título de SECTION ausente antes de declaración de USE

source: USE DEBUGGING not supported in contained program
es: USE DEBUGGING no apoyado en contenidos del programa

source: Duplicate USE DEBUGGING ON ALL PROCEDURES
es: USE DEBUGGING ON ALL PROCEDURES duplicado

source: Invalid target for DEBUGGING ALL
es: Objectivo inválido para DEBUGGING ALL

source: LINAGE-COUNTER must be qualified here
es: LINAGE-COUNTER debe ser calificado aquí

source: Invalid LINAGE-COUNTER usage
es: Uso inválido de LINAGE-COUNTER

source: '%s' is not a file name
es: '%s' no es nombre de archivo

source: LINE-COUNTER must be qualified here
es: LINE-COUNTER debe ser calificado aquí

source: Invalid LINE-COUNTER usage
es: Uso inválido de LINE-COUNTER

source: '%s' is not a report name
es: '%s' no es nombre de reporte

source: PAGE-COUNTER must be qualified here
es: PAGE-COUNTER debe ser calificado aquí

source: Invalid PAGE-COUNTER usage
es: Uso inválido de PAGE-COUNTER

source: '%s' not indexed
es: '%s' no indexado

source: '%s' defined here
es: '%s' definido aquí

source: Multiple reference to '%s'
es: Referencias multiples a '%s'

source: Invalid mnemonic identifier
es: Identificador mnemónico inválido

source: Integer value expected
es: Esperando valor de número entero

source: Invalid SYMBOLIC integer
es: Número entero SYMBOLIC inválido

source: Invalid integer
es: Número entero inválido

source: Invalid CLASS value
es: Inválido valor de CLASS

source: Ignoring LEAP-SECOND directive
es: Ignorando directiva LEAP-SECOND

source: Ignoring empty directive
es: Ignorando directiva vacía

source: Ignoring invalid directive - '%s'
es: Ignorando directiva inválida - '%s'

source: Ignoring invalid directive
es: Ignorando directiva inválida

source: Spurious '$' detected - ignoring
es: Detectados '$' falsos - ignorando

source: PROCESS statement ignored
es: Declaración de PROCESS ignorado

source: Dangling IF/ELSE directive
es: Directiva de IF/ELSE colgando

source: Directive nest depth exceeded - %d
es: Profundidad excedida en el nido directivo -% d

source: ELSE directive without matching IF/ELIF
es: Directiva ELSE sin IF/ELIF acompañados

source: END-IF directive without matching IF/ELIF/ELSE
es: Directiva END-IF sin IF/ELIF/ELSE acompañados

source: ELIF directive without matching IF/ELIF
es: Directiva ELIF sin IF/ELIF acompañados

source: Buffer overrun - Literal too long - Aborting
es: desbordamiento de búfer - Literal demasiado tiempo - Abortar

source: Line not terminated by a newline
es: Linea no terminada por una nueva linea

source: Source text after column %d
es: Origen de texto despues de columna %d

source: Invalid continuation in comment entry
es: Inválida continuacion de comentario de entrada.

source: Invalid indicator '%c' at column 7
es: Inválida indicador '%c' en columna 7

source: Invalid line continuation
es: Continuación de linea inválida

source: Continuation character expected
es: Continuación de carácter esperado

source: Duplicate define
es: Definir duplicado

source: Invalid constant
es: Constante inválida

source: Invalid SOURCEFORMAT directive
es: Directiva SOURCEFORMAT inválida

source: Invalid FOLD-COPY-NAME directive
es: Directiva FOLD-COPY-NAME inválida

source: Invalid SOURCE directive
es: Directiva SOURCE inválida

source: Invalid DEFINE/SET directive
es: Directiva EFINE/SET inválida

source: TURN directive not yet implemented
es: TURN directiva no se a implementado aun

source: Invalid IF/ELIF directive
es: Directiva IF/ELIF inválida

source: Device name
es: Nombre de dispositivo

source: Switch name
es: Nombre de interruptor

source: Feature name
es: Nombre de prestación

source: Unknown
es: Desconocido

source: '%s' reserved word, but not supported
es: '%s' palabra reservada, pero no apoyada

source: Extra internal registers Definition
es: Registros internos extras Definición

source: Intrinsic Function Implemented Parameters
es: Función Intrínseca Implementada Parámetros

source: Mnemonic names
es: Nombres Mnemotécnico

source: Word length exceeds 31 characters - '%s'
es: Tamaño de palabra excede los 31 caractéres - '%s'

source: Word length exceeds maximum allowed - '%s'
es: Tamaño de palabra excede lo máximo permitido - '%s'

source: A constant may not be used here - '%s'
es: Una constante no puede ser utilizada aquí - '%s'

source: Invalid symbol: %s - Skipping word
es: símbolo inválido: %s - Omisión de la palabra

source: Alphanumeric literal has zero length
es: Literal afanumérica tiene longitud de cero

source: A SPACE will be assumed
es: Un SPACE será asumido

source: Invalid X literal: %s
es: Literal X inválida: %s

source: Invalid H literal: %s
es: Literal H inváida: %s

source: Invalid numeric literal
es: Literal numérica invalida

source: Invalid floating-point literal
es: Literal de punto flotante inválida

source: Invalid CONSTANT - %s
es: Invalida CONSTANT - %s

source: Invalid alphanumeric CONSTANT - %s
es: CONSTANT alfanumérica inválida - %s

source: Empty alphanumeric CONSTANT - %s
es: CONSTANT alfanumérica vacía - %s

source: Invalid numeric CONSTANT - %s
es: CONSTANT numérica inválida - %s

source: %s clause is required for file '%s'
es: Cláusula %s es requerida para el archivo '%s'

source: Internal error node
es: Nodo de error interno

source: Unknown constant
es: #<constante desconocido>

source: FUNCTION %s has invalid/not supported arguments - Tag %d
es: FUNCTION %s tiene argumentos inválidos/no apoyados - Tag %d

source: Unexpected cast type -> %d
es: Tipo de molde inesperado -> %d

source: Unknown tree tag %d Category %d
es: Desconocida etiqueta de árbol %d Categoria %d

source: Unexpected numeric usage -> %d
es: Uso numérico inesperado -> %d

source: Unexpected category -> %d
es: Categoría inesperada -> %d

source: Numeric literal exceeds limit - Aborting
es: Literal numérico excede el límite - Abortando

source: Invalid LOCALE literal
es: Inválido literal LOCAL

source: Invalid picture string - '%s'
es: Inválida cadena de picture - '%s'

source: Numeric field cannot be larger than %d digits
es: Campo numérico no puede exceder %d digitos

source: ALTERNATE clause invalid for this file type
es: Cláusula ALTERNATE inválida para este tipo de archivo

source: RECORD clause invalid for this file type
es: Cláusula RECORD inválida para este tipo de archivo

source: ORGANIZATION clause invalid
es: Inválida cláusula ORGANIZATION

source: Invalid KEY item '%s'
es: Inválido elemeto KEY '%s'

source: Record size too small '%s'
es: Tamaño de récord demasiado pequeño '%s'

source: Record size too large '%s' (%d)
es: Tamaño de récord demasiado grande '%s' (%d)

source: Invalid expression
es: Expresión inválida

source: Unexpected operator -> %d
es: Operador inesperado -> %d

source: FUNCTION '%s' has invalid reference modification
es: FUNCTION '%s' tiene modificación por referencia inválida

source: FUNCTION '%s' unknown
es: FUNCTION '%s' desconocida

source: FUNCTION '%s' not implemented
es: FUNCTION '%s' no implementada

source: FUNCTION '%s' has wrong number of arguments
es: FUNCTION '%s' tiene el número incorrecto de argumentos

source: FUNCTION '%s' can not have reference modification
es: FUNCTION '%s' no puede tener la modificación por referencia

source: FUNCTION '%s' has invalid parameter
es: FUNCTION '%s' tiene parámetro inválido

source: FUNCTION '%s' has invalid first parameter
es: FUNCTION '%s' tiene primer parámetro inválido

source: Invalid use of 88 level item
es: Uso inválido de elemento de nivel 88

source: '%s' is not group name
es: '%s' no es nombre de grupo

source: '%s' is not a numeric name
es: '%s' no es un nombre numérico

source: '%s' is not numeric or numeric-edited name
es: '%s' no es nombre numérico o editado-numérico

source: '%s' is not a numeric value
es: '%s' no es un valor numérico

source: '%s' is not an integer value
es: '%s' no es un valor entero

source: A positive numeric integer is required here
es: Un número entero positivo es requerido aquí

source: System routine Parameters
es: Rutina de sistema Parámetros

source: ON/OFF usage requires a SWITCH name
es: Uso de ON/OFF requiere el nombre de un SWITCH

source: ASSIGN interpreted as %s
es: ASSIGN interpretarse en el %s

source: '%s' cannot be reference modified
es: '%s' no puede ser modificado por referencia

source: '%s' cannot be subscripted
es: '%s' no puede ser subíndice

source: '%s' requires 1 subscript
es: '%s' requiere 1 subíndice

source: '%s' requires %d subscripts
es: '%s; requiere %d subíndices

source: '%s' has no OCCURS clause
es: '%s' no tiene cláusula de OCCURS

source: Subscript of '%s' out of bounds: %d
es: Subíndice de '%s' fuera de límites: %d

source: Offset of '%s' out of bounds: %d
es: Compensación de '%s' fuera de límites: %d

source: Length of '%s' out of bounds: %d
es: Longitud de '%s' fuera de límites: %d

source: Reference modification not allowed here
es: Modificado por referencia no se permite aquí

source: ANY LENGTH item not allowed here
es: Elemento de ANY LENGTH no se permite aquí

source: 88 level item not allowed here
es: Elemento del nivel 88 no es permitido aquí

source: Variable length item not allowed here
es: Elemento de longitud variable no es permitido aquí

source: '%s' is not an alphabet name
es: '%s' no es un nombre de alfabeto

source: Duplicate character values in alphabet '%s'
es: Valores de carácter duplicados en alfabeto '%s'

source: Invalid character values in alphabet '%s'
es: Valores de carácter inválidos en alfabeto '%s'

source: Invalid ALPHABET name
es: Nombre de ALPHABET inválido

source: Duplicate values in class '%s'
es: Valores duplicados en clase '%s'

source: '%s' is not a locale name
es: '%s' no es un nombre local

source: '%s' will be implicitly defined
es: '%s' será definido de forma implícita

source: ASSIGN data item '%s' invalid
es: ASSIGN elementos de datos '%s' inválido

source: '%s' CURSOR is not 4 or 6 characters long
es: '%s' CURSOR no es de 4 o 6 caractéres de longitud

source: '%s' CRT STATUS is not 4 characters long
es: '%s' CRT STATUS no es de 4 caractéres de longitud

source: '%s' ODO field item invalid here
es: '%s' elemento de campo ODO inválido aquí

source: '%s' cannot have OCCURS DEPENDING
es: '%s' no puede tener OCURRS DEPENDING

source: '%s' ODO item must have GLOBAL attribute
es: '%s' elemento ODO debe tener atributo GLOBAL

source: RECORD DEPENDING item must be in WORKING/LOCAL/LINKAGE section
es: Elemento RECORD DEPENDING debe de estar en sección WORKING/LOCAL/LINKAGE

source: Invalid RECORD DEPENDING item
es: Elemento RECORD DEPENDING inválido

source: '%s' is not in DECLARATIVES
es: '%s' no se encuentra en DECLARATIVES

source: Invalid reference to '%s' (In DECLARATIVES)
es: Referencia a '%s' inválida (En DECLARATIVES)

source: '%s' not a procedure name
es: '%s' no es el nombre de un procedimiento

source: '%s' - DEBUGGING target invalid with ALL PROCEDURES
es: '%s' - objectivo de DEBUGGING inválido con ALL PROCEDURES

source: '%s' - DEBUGGING target invalid
es: '%s' - objetivo de DEBUGGING inválido

source: '%s' is not a valid DEBUGGING target
es: '%s' no es un objetivo válido de DEBUGGING

source: '%s' is not an alterable paragraph
es: '%s' no es un párrafo modificable

source: Suggest parentheses around AND within OR
es: Parentesis sugeridos alrededor de AND dentro de OR

source: Internal decimal structure size exceeded - %d
es: Tamaño de estructura decimal interna excedido - %d

source: Unexpected operation %d
es: Operación %d inesperada

source: Unexpected constant expansion
es: Expansión inesperada de constante

source: No CORRESPONDING items found
es: No se encontraron elementos CORRESPONDING

source: Invalid PROMPT literal
es: Literal PROMPT inválido

source: Invalid PROMPT identifier
es: Identificador PROMPT inválido

source: Invalid input device '%s'
es: Dispositivo de entrada '%s' inválido

source: '%s' is not defined in SPECIAL-NAMES
es: '%s' no esta definido en SPECIAL-NAMES

source: Target of ALLOCATE is not a BASED item
es: Destino de ALLOCATE no es un elemento BASED

source: Target of RETURNING is not a data pointer
es: Destino de RETURNING no es un puntero de datos

source: The CHARACTERS field of ALLOCATE must be numeric
es: El campo CHARACTERS de ALLOCATE debe ser numérico

source: INITIALIZED TO item is not alphanumeric
es: Elemento INITIALIZED TO no es alfanumérico

source: Only alphanumeric FUNCTION types are allowed here
es: Solamente tipos alfanuméricos FUNCTION son permitidos aquí

source: Invalid RETURNING field
es: Campo RETURNING inválido

source: STDCALL not available on this platform
es: STDCALL no disponible en esta plataforma

source: STDCALL used on 64-bit Windows platform
es: STDCALL utilizado en plataforma Windows de 64 bits

source: STATIC CALL convention requires a literal program name
es: Convención STATIC CALL requiere un nombre literal de programa

source: Figurative constant invalid here
es: Constante figurativa inválida aquí

source: '%s' is not a valid data name
es: '%s' no es un nombre valido de datos

source: '%s' ANY LENGTH item not passed BY REFERENCE
es: '%s' Elemento de ANY LENGTH no pasó BY REFERENCE

source: '%s' is not a 01 or 77 level item
es: '%s' no es un elemento de nivel 01 ó 77

source: Wrong number of CALL parameters for '%s'
es: Número incorrecto de parámetros en CALL para '%s'

source: Operation not allowed on SORT files
es: Operación no permitida en archivos de SORT

source: Operation not allowed on LINE SEQUENTIAL files
es: Operación no permitida en archivos de LINE SEQUENTIAL

source: '%s' is an invalid type for DISPLAY operand
es: '%s' es un tipo inválido de operando de DISPLAY

source: Invalid type for DISPLAY operand
es: Tipo inválido para operando de DISPLAY

source: Invalid output device
es: Dispositivo de salida inválido

source: '%s' is not an output device
es: '%s' no es un dispositivo de salida

source: Invalid use of 88 level in WHEN expression
es: Uso inválido de nivel 88 en expresion WHEN

source: Wrong number of WHEN parameters
es: Número equivocado de parámetros para WHEN

source: Target %d of FREE is not a BASED data item
es: Objectivo %d de FREE no es un elemento de datos BASED

source: Target %d of FREE must be a data pointer
es: Objetivo %d de FREE debe ser un puntero de datos

source: GO TO with multiple procedure-names
es: GO TO con multiples nombres-procedimiento

source: REPLACING operands differ in size
es: Operandos de REPLACING difieren en tamaño

source: Invalid target for INSPECT
es: Destino inválido para INSPECT

source: Invalid target for REPLACING/CONVERTING
es: Destino inválido para REPLACING/CONVERTING

source: Data name expected before CHARACTERS
es: Nombre de datos esperado antes que CHARACTERS

source: Data name expected before ALL
es: Nombre de datos esperado antes que ALL

source: Data name expected before LEADING
es: Nombre de datos esperado antes de LEADING

source: Data name expected before TRAILING
es: Nombre de datos esperado antes de TRAILING

source: ALL, LEADING or TRAILING expected before '%s'
es: ALL, LEADING o TRAILING esperado antes de '%s'

source: Operand has wrong size
es: Operando tiene el tamaño equivocado

source: Internal register '%s' defined as BINARY-LONG
es: Registros internos '%s' definidos como BINARY-LONG

source: '%s' defined here as USAGE %s
es: '%s' definido aquí como USAGE %s

source: '%s' defined here as USAGE FLOAT
es: '%s' definido aquí como USAGE FLOAT

source: '%s' defined here as USAGE DOUBLE
es: '%s' definido aquí como USAGE DOUBLE

source: '%s' defined here as USAGE FLOAT EXTENDED
es: '%s' definido aquí como USAGE FLOAT EXTENDED

source: '%s' defined here as USAGE FLOAT-BINARY-7
es: '%s' definido aquí como USAGE FLOAT-BINARY-7

source: '%s' defined here as USAGE FLOAT-BINARY-16
es: '%s' definido aquí como USAGE FLOAT-BINARY-16

source: '%s' defined here as USAGE FLOAT-BINARY-34
es: '%s' definido aquí como USAGE FLOAT-BINARY-34

source: '%s' defined here as USAGE FLOAT-DECIMAL-16
es: '%s' definido aquí como USAGE FLOAT-DECIMAL-16

source: '%s' defined here as USAGE FLOAT-DECIMAL-34
es: '%s' definido aquí como USAGE FLOAT-DECIMAL-34

source: '%s' defined here as PIC %s
es: '%s' definido aquí como PIC %s

source: '%s' defined here as a group of length %d
es: '%s' definido aquí como un grupo de longitud %d

source: Overlapping MOVE may produce unpredictable results
es: Superposición de MOVE puede producir resultados impredecibles

source: Invalid destination for MOVE
es: Destinación inválida para MOVE

source: Source is non-numeric - substituting zero
es: Origen es no-numérico - substituyendo cero

source: Numeric move to ALPHABETIC
es: Movimiento numérico a ALPHABETIC

source: Data item not signed
es: Elemento de datos no tiene signo

source: Ignoring sign
es: Ignorando signo

source: Invalid source for MOVE
es: Origen inválido para MOVE

source: Invalid VALUE clause
es: Cláusula VALUE inválida

source: Invalid MOVE statement
es: Declaración MOVE inválida

source: Invalid VALUE clause - literal exceeds data size
es: Cláusula VALUE inválida - literal excede tamaño de dato

source: Numeric literal exceeds data size
es: Literal numérico excede tamaño de dato

source: Move non-integer to alphanumeric
es: Mover no-números enteros a alfanumérico

source: Numeric value is expected
es: Valor numérico es esperado

source: Alphanumeric value is expected
es: Valor alfanumerico es esperado

source: Value does not fit the picture string
es: Valor no se ajusta a la cadena de picture

source: Value size exceeds data size
es: Tamaño de valor excede tamaño de datos

source: Sending field larger than receiving field
es: Campo a enviar más grande que el campo a recibir

source: Some digits may be truncated
es: Algunos digitos pueden ser truncado

source: Invalid MOVE target - %s
es: Destino inválido al MOVE - %s

source: OPEN I-O not allowed on LINE SEQUENTIAL files
es: OPEN I-O no se permite en archivos de LINE SEQUENTIAL

source: KEY ignored with sequential READ
es: KEY ignorado con READ sequencial

source: REWRITE requires a record name as subject
es: REWRITE requiere un nombre de registro como sujeto

source: REWRITE subject does not refer to a record name
es: Sujeto a REWRITE no hace referencia a un nombre de récord

source: RELEASE requires a record name as subject
es: RELEASE require un nombre de un récord como sujeto

source: RELEASE subject does not refer to a record name
es: Sujeto de RELEASE no hace referencia a nombre de un récord

source: RELEASE not allowed on this record item
es: RELEASE no permitido en este elemento de récord

source: Invalid SEARCH ALL condition
es: Condición inválida de SEARCH ALL

source: The targets of SET must be either indexes or pointers
es: Los destinos del SET deben ser índices o indicadores
