Repository: ayumin/open-cobol
Catalog: branches/gnu-cobol-cpp/po/*.po
Languages: es

source: Invalid %s parameter
es: Parámetro inválido %s

source: Too many errors - Aborting compilation
es: Demasiados errores - Abortando compilación

source: %s:%d Internal compiler error
es: %s:%d Error interno de compilador

source: Call to cobc_strdup with NULL pointer
es: Llamada a cobc_strdup con puntero NULL

source: Call to cobc_main_strdup with NULL pointer
es: Llamada a cobc_main_strdup con indicador NULL

source: Attempt to reallocate non-allocated memory - Aborting
es: Intento de referencia a memoria sin asignar - Abortar

source: Call to cobc_parse_strdup with NULL pointer
es: Llamada a cobc_parse_strdup con indicador NULL

source: Call to cobc_plex_strdup with NULL pointer
es: Llamada a cobc_plex_strdup con indicador NULL

source: Call to cobc_check_string with NULL pointer
es: Llamada a cobc_check_string con puntero NULL

source: Invalid file base name '%s'%s
es: Nombre de base de archivo inválido '%s'%s

source: Invalid ENTRY '%s'%s
es: ENTRY inválido '%s'%s

source: Invalid PROGRAM-ID '%s'%s
es: PROGRAM-ID inválido '%s'%s

source: Duplicate define '%s' - Ignoring
es: Definición duplicada '%s' - Ignorando

source: Call to cobc_stradd_dup with NULL pointer
es: Llamada a cobc_stradd_dup con puntero NULL

source: Parameter buffer size exceeded
es: Tamaño de búfer del parámetro excedido

source: Warning - Could not move temporary file to %s
es: Alerta - No se pudo mover el archivo temporal a %s

source: Aborting compile of %s at line %d
es: Abortando compilación de %s en el renglón %d

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
es: Este es un software gratis; vea el orígen para condiciones de copiado. NO existe garantía; ni siquiera para COMERCIALIZACIÓN o AJUSTES PARA UN PROPÓSITO PARTICULAR.

source: Built %s
es: Construido %s

source: Packaged %s
es: Empaquetado %s

source: C version %s%s
es: Version C %s%s

source: Executing:
es: Ejecutando:

source: Build information
es: Información de generación

source: Build environment
es: Ambiente de generación

source: Dynamic loading
es: Carga dinámica

source: System
es: Sistema

source: Enabled
es: Activado

source: Disabled
es: Desactivado

source: Variable format
es: Formato de variable

source: Sequential handler
es: Controlador secuencial

source: External
es: Externo

source: Internal
es: Interno

source: ISAM handler
es: Controlador ISAM

source: - NOT set with -Wall
es: - NO esta definido con -Wall

source: Usage: cobc [options] file ...
es: Uso: cobc [options] file ...

source: Options:
es: Opciones:

source: -help Display this message
es: -help Muestra este mensaje

source: -version, -V Display compiler version
es: -version, -V Muestra version del compilador

source: -info, -i Display compiler build information
es: -info, -i Muestra la información de generación del compilador

source: -v Display the commands invoked by the compiler
es: -v Muestra los comandos invocados por el compilador

source: -x Build an executable program
es: -x Genera un programa ejecutable

source: -std=<dialect> Warnings/features for a specific dialect :
es: -std=<dialect> Alertas/prestaciones para dialecto específico :

source: ibm IBM Compatible
es: ibm Compatible con IBM

source: mvs MVS Compatible
es: mvs Compatible con MVS

source: bs2000 BS2000 Compatible
es: bs2000 Compatible con BS2000

source: mf Micro Focus Compatible
es: mf Compatible con Micro Focus

source: default When not specified
es: por defecto Cuando no ha sido especificado

source: See config/default.conf and config/*.conf
es: Ver config/default.conf y config/*.conf

source: -free Use free source format
es: -free Utilizar formato de liberar origen

source: -O, -O2, -Os Enable optimization
es: -O, -O2, -Os Optimización activado

source: -g Enable C compiler debug / stack check / trace
es: -g Permite depuración de compilador C / verificación de montón / rastrear

source: -debug Enable all run-time error checking
es: -debug Permite verificación de errores en tiempo de ejecución

source: -o <file> Place the output into <file>
es: -o <file> Coloque el resultado en <file>

source: -b Combine all input files into a single
es: -b Combinar todos los archivos de entrada en un solo

source: dynamically loadable module
es: módulo de carga dinámica

source: -E Preprocess only; do not compile or link
es: -E Preprocesar solamente; no compilar o enlazar

source: -C Translation only; convert COBOL to C
es: -C Traducción solamente; convertir COBOL a C

source: -S Compile only; output assembly file
es: -S Compilar solamente; salida de archivo de ensamblado

source: -c Compile and assemble, but do not link
es: -c Compilar y ensamblar, pero no enlanzar

source: -Xref Generate cross reference through 'cobxref'
es: -Xref Genera referencia cruzada mediante 'cobxref'

source: -I <directory> Add <directory> to copy/include search path
es: -I <directory> Añadir <directory> para copiar/incluir ruta de búsqueda

source: -L <directory> Add <directory> to library search path
es: -L <directory> Añadir <directory> a la ruta de búsqueda de bibloteca

source: -l <lib> Link the library <lib>
es: -l <lib> Enlace a bibloteca <lib>

source: -A <options> Add <options> to the C compile phase
es: -A <options> Añadir <options> a la fase de compilador C

source: -Q <options> Add <options> to the C link phase
es: -Q <options> Agregar <options> a la frase de enlace C

source: -D <define> DEFINE <define> to the COBOL compiler
es: -D <define> DEFINE <define> a el compilador COBOL

source: -K <entry> Generate CALL to <entry> as static
es: -K <entry> Generar CALL a <entry> como estática

source: -conf=<file> User defined dialect configuration - See -std=
es: -conf=<file> Configuración de dialecto definido por usuario - Ver -std=

source: -list-reserved Display reserved words
es: -list-reserved Mostrar palabras reservadas

source: -list-intrinsics Display intrinsic functions
es: -list-intrinsics Mostrar funciones intrínsica

source: -list-mnemonics Display mnemonic names
es: -list-mnemonics Muestra nombres mnemotécnico

source: -list-system Display system routines
es: -list-system Muestra rutinas del sistema

source: -save-temps(=<dir>) Save intermediate files
es: -save-temps(=<dir>) Guardar archivos intermediate

source: - Default : current directory
es: - (por efecto el directorio actual)

source: -ext <extension> Add default file extension
es: -ext <extension> Añadir por defecto extensión de archivo

source: -W Enable ALL warnings
es: -W Activar ALL las alertas

source: -Wall Enable all warnings except as noted below
es: -Wall Activar todas las alertas excepto lo señalado abajo

source: Only one of options 'E', 'S', 'C', 'c' may be specified
es: Solamente una de las opciones 'E', 'S', 'C', 'c' se puede especificar

source: Only one of options 'm', 'x', 'b' may be specified
es: Solo una opción 'm', 'x', 'b' puede ser especificada

source: '%s' is not an intrinsic function
es: '%s' no es una función intrínseca

source: Invalid output file name
es: Nombre de archivo de salida inválido

source: Invalid option -std=%s
es: Inválida opción -std=%s

source: Warning - '%s' is not a directory, defaulting to current directory
es: Alerta - '%s' no es un directorio, por defectuo en el directorio actual

source: Warning - assuming '%s' is a DEFINE - did you intend to use -debug?
es: Alerta - asumiendo '%s' es un DEFINE - querias depurar?

source: Invalid option detected
es: Opción inválida detectada

source: Failed to load the initial config file
es: No se pudo cargar el archivo config inicial

source: Invalid tab-width value - %d
es: Valor inválido a etiqueta-anchura- %d

source: Invalid text-column value - %d
es: Valór inválido a columna-texto - %d

source: Invalid file name parameter
es: Parámetro nombre de archivo inválido

source: Unknown option ignored: %s
es: Opción desconosida ignorada: %s

source: Return status:
es: Estado de resultado:

source: Preprocessing:
es: Preprocesamiento:

source: 'cobxref' execution unsuccessful
es: 'cobxref' execución sin éxito

source: Check that 'cobxref' is in %%PATH%%
es: Comprobar que 'cobxref' este dentro de %%PATH%%

source: Check that 'cobxref' is in $PATH
es: Comprobar que 'cobxref' este dentro de $PATH

source: No listing produced
es: No produció listado

source: Parsing:
es: Analizando:

source: Translating:
es: Traduciendo:

source: No input files
es: No archivo de entrada

source: -o option invalid in this combination
es: -o opción inválida con esta combinación

source: Command line:
es: Línea de comandos:

source: Unexpected CONSTANT item
es: Elemento CONSTANT inesperado

source: Unexpected tree tag %d
es: Inesperada etiqueta de árbol %d

source: Unexpected cast type %d
es: Tipo de molde inesperado %d

source: Internal statement stack depth exceeded -> %d
es: Profundidad excedida en montón interno de declaración -> %d

source: Unexpected function %s
es: Función inesperada %s

source: Unexpected constant
es: Constante inesperada

source: Unexpected tree category %d
es: Categoría de árbol inesperada %d

source: Unexpected error_node parameter
es: Parámetro error_node inesperado

source: Unexpected tree type %d
es: Tipo de árbol inesperado %d

source: Invalid value for '%s'
es: Valor inválido para '%s'

source: '%s' not supported
es: '%s' no es apoyado

source: Invalid line
es: Linea inválida

source: Unknown tag '%s'
es: Etiquetas desconocida '%s'

source: Invalid type for '%s'
es: Tipo inválido para '%s'

source: %s: No definition of '%s'
es: %s: No hay definición de '%s'

source: In section
es: En sección

source: In paragraph
es: En párrafo

source: Warning:
es: Alerta:

source: %s is archaic in %s
es: %s es arcaico en %s

source: %s is obsolete in %s
es: %s es obsoleto en %s

source: %s ignored
es: %s ignorado

source: %s does not conform to %s
es: %s no se ajusta a %s

source: Redefinition of '%s'
es: Redefinición de '%s'

source: '%s' previously defined here
es: '%s' previamente definidos aquí

source: %s is not defined
es: %s no esta definido

source: %s ambiguous; need qualification
es: %s ambiguo; necesita cualificación

source: defined here
es: definido aquí

source: Group item '%s' cannot have %s clause
es: Elemento de grupo '%s' no puede tener cláusula %s

source: Constant item '%s' cannot have a %s clause
es: Elemento constante '%s' no puede tener una cláusula %s

source: Level %02d item '%s' cannot have a %s clause
es: Elemento de nivel %02d '%s' no puede tener cláusula %s

source: Constant item '%s' requires a %s clause
es: Constante elemento '%s' requiere clausula %s

source: Level %02d item '%s' requires a %s clause
es: Nivel %02d elemento '%s' requiere una %s cláusula

source: Constant item '%s' can only have a %s clause
es: Elemento constante '%s' solo puede tener cláusula %s

source: Level %02d item '%s' can only have a %s clause
es: Nivel %02d elemento '%s' solo puede tener una %s cláusula

source: Invalid level number '%s'
es: Inválido numero de nivel '%s'

source: Level number must begin with 01 or 77
es: Nivel de numero debe de comenzar con 01 o 77

source: No previous data item of level %02d
es: No elementos de datos previamente de nivel %02d

source: '%s' cannot be qualified here
es: '%s' no se puede calificar aquí

source: '%s' cannot be subscripted here
es: '%s' no puede ser subíndice aquí

source: '%s' is not defined in '%s'
es: '%s' no esta definido en '%s'

source: Level number of REDEFINES entries must be identical
es: Numero de nivel de entradas REDEFINES deben ser identicas

source: Level number of REDEFINES entry cannot be 66 or 88
es: Numero de nivel de entrada REDEFINES no pueden ser 66 ó 88

source: '%s' not the original definition
es: '%s' no la definición original

source: BLANK ZERO not compatible with USAGE
es: BLANK ZERO no es compatible con USAGE

source: SIGN clause not compatible with USAGE
es: Cláusula de SIGN no compatible con USAGE

source: PICTURE clause required for '%s'
es: Cláusula de PICTURE requerida para '%s'

source: A non-numeric literal is expected for '%s'
es: Un literal no-numérico es esperado para '%s'

source: Defining implicit picture size %d for '%s'
es: Definiendo tamaño implicito de picture %d para '%s'

source: '%s' ANY LENGTH only allowed in LINKAGE
es: '%s' ANY LENGTH solamente permitido en LINKAGE

source: '%s' ANY LENGTH must be 01 level
es: '%s' ANY LENGTH debe ser nivel 01

source: '%s' ANY LENGTH can not be BASED/EXTERNAL
es: '%s' ANY LENGTH no puede ser BASED/EXTERNAL

source: '%s' ANY LENGTH has invalid definition
es: '%s' ANY LENGTH tiene definición inválida

source: '%s' ANY LENGTH must have a PICTURE
es: '%s' ANY LENGTH debe tener un PICTURE

source: '%s' 77 level not allowed here
es: '%s' nivel 77 no se permite aquí

source: '%s' EXTERNAL must be specified at 01/77 level
es: '%s' EXTERNAL se debe que especificar a nivel 01/77

source: '%s' EXTERNAL can only be specified in WORKING-STORAGE section
es: '%s' EXTERNAL solo puede ser especificado en sección WORKING-STORAGE

source: '%s' EXTERNAL and BASED are mutually exclusive
es: '%s' EXTERNAL y BASED son mutualmente excluyentes

source: '%s' EXTERNAL not allowed with REDEFINES
es: '%s' EXTERNAL no permitida para REDEFINES

source: '%s' BASED not allowed here
es: '%s' BASED no se permite aquí

source: '%s' BASED not allowed with REDEFINES
es: '%s' BASED no permitido con REDEFINES

source: '%s' BASED only allowed at the 01 and 77 levels
es: '%s' BASED solamente se permite a los niveles 01 y 77

source: '%s' cannot have the OCCURS clause due to '%s'
es: '%s' no puede tener la cláusula OCURRS debido a '%s'

source: The original definition '%s' should not have OCCURS
es: La definición original '%s' no debe tener OCURRS

source: REDEFINES must follow the original definition
es: REDEFINES debe seguir la definición original

source: '%s' cannot be variable length
es: '%s' no puede ser de longitud variable

source: The original definition '%s' cannot be variable length
es: La definición original '%s' no puede ser de longitud variable

source: SCREEN group item '%s' has invalid clause
es: Elemento de grupo '%s' tiene clausula invalida

source: '%s' cannot have PICTURE clause
es: '%s' no puede tener cláusula de PICTURE

source: '%s' PICTURE clause not compatible with USAGE
es: '%s' cláusula de PICTURE no es compatible con USAGE

source: '%s' COMP-6 with sign - Changing to COMP-3
es: '%s' COMP-6 con signo - Cambiando a COMP-3

source: '%s' cannot have JUSTIFIED RIGHT
es: '%s' no se puede tener JUSTIFIED RIGHT

source: '%s' cannot have BLANK WHEN ZERO
es: '%s' no se puede tener BLANK WHEN ZERO

source: Only level 88 item may have multiple values
es: Solamente elemento de nivel 88 puede tener valores multiples

source: Entries under REDEFINES cannot have a VALUE clause
es: Entradas bajo REDEFINES no pueden tener una clásula de VALUE

source: Initial VALUE clause ignored for EXTERNAL item
es: Cláusula inicial de VALUE ignorada para elemento EXTERNAL

source: Ignoring SYNCHRONIZED for group item '%s'
es: ignorando SYNCHRONIZIED para la partida del grupo '%s'

source: Size of '%s' larger than size of '%s'
es: Tamaño de '%s' más grande que el tamaño de '%s'

source: '%s' binary field cannot be larger than %d digits
es: '%s' campo binario no puede ser mayor de %d dígitos

source: Unexpected usage - %d
es: Uso inesperado - %d

source: Literal type does not match data type
es: Tipo literal no coincide con el tipo de datos

source: Define PERFORM stack size - Default : 255
es: Definir tamaño de montón PERFORM - Por defecto -: 255

source: Define cutoff depth for IF statements - Default : 3
es: Definir límite de profundidad para declaraciones IF - Por defecto : 3

source: Output static function calls for the CALL statement
es: Función estática de salida llama la declaración de CALL

source: Generate computed goto C statements
es: Generar declaraciones computadas en C de ir

source: Use restricted ASCII to EBCDIC translate
es: Use ASCII restringido al traducir EBCDIC

source: Generate extra braces in generated C code
es: Generar corchetes adicionales en el código C generado

source: Attempt correction of invalid numeric display items
es: Intentar corrección de los elementos numéricos mostrados inválidos

source: PERFORM stack allocated on heap
es: Montón de PERFORM asignado en pila

source: Generate trace code - Executed SECTION/PARAGRAPH
es: Generar código de rastreo - Ejecutado SECTION/PARAGRAPH

source: Generate trace code - Executed SECTION/PARAGRAPH/STATEMENTS - Turned on by -debug
es: Generar código de rastreo - Ejecutado SECTION/PARAGRAPH/STATEMENTS - Activado por -debug

source: Syntax error checking only; don't emit any output
es: Solamente revisando error de sintaxis, no emitir ningún resultado

source: Enable debugging lines - 'D' in indicator column or floating >>D
es: Habilitar la depuración de lineas - ‘D’ en la columna de indicador o flotando >>D

source: Generate source location code - Turned on by -debug/-g/-ftraceall
es: Generar la ubicación del código de fuente - Activado por -debug/-g/-ftraceall

source: Automatic initialization of the Cobol runtime system
es: Inicialización automática del sistema de ejecución COBOL

source: PERFORM stack checking - Turned on by -debug or -g
es: PERFORM revisión de montón - Activado por -debug o -g

source: Allow syntax extensions - eg. Switch name SW1, etc.
es: Perimite extension de sintaxis - (e.g. Nombre de interruptor SW1, etc.)

source: Use AFTER 1 for WRITE of LINE SEQUENTIAL - Default : BEFORE 1
es: Utilizar AFTER 1 para WRITE de LINE SEQUENTIAL - Por Defecto : BEFORE 1

source: '*' or '/' in column 1 treated as comment - FIXED format only
es: ‘*’ o ‘/’ en columna 1 tratado como comentario - unicamente en formato FIXED

source: Allow numeric field overflow - Non-ANSI behaviour
es: Permitir desbordamiento del campo numérico - comportamiento Non-ANSI

source: Adjust items following OCCURS DEPENDING - Requires implicit/explicit relaxed syntax
es: Ajuste los elementos después de OCCURS DEPENDING - Requiere sintaxis relajado implicito/explicito

source: Check recursive program call
es: Revise llamada recursiva del programa

source: Relax syntax checking - eg. REDEFINES position
es: Comprobación de sintaxis relajado - eg. Posicion REDEFINES

source: Treat all files as OPTIONAL - unless NOT OPTIONAL specified
es: Tratar todos los archivos como OPTIONAL - a menos que se especifique NOT OPTIONAL

source: '%s' not implemented
es: '%s' aun no implementado

source: Unreachable statement '%s'
es: Declaración inalcanzable '%s'

source: '%s' not level 01 or 77
es: '%s' no nivel 01 ó 77

source: '%s' is not in LINKAGE SECTION
es: ‘%s’ no esta en LINKAGE SECTION

source: '%s' can not be BASED/EXTERNAL
es: ‘%s’ no puede ser BASED/EXTERNAL

source: '%s' is not in WORKING-STORAGE SECTION
es: ‘%s’ no esta en la WORKING-STORAGE SECTION

source: '%s' REDEFINES field not allowed here
es: ‘%s’ Campo de REDEFINES no se permite aquí

source: LINKAGE item '%s' is not a PROCEDURE USING parameter
es: Elemento '%s' LINKAGE no es un parámetro PROCEDURE USING

source: ENTRY '%s' duplicated
es: ENTRY '%s' duplicado

source: %s statement not terminated by END-%s
es: Declaracion %s no terminado por END-%s

source: USE statement invalid for SORT file
es: Declaracion USE inválida con archivo SORT

source: Duplicate %s clause
es: Duplicar %s cláusula

source: %s header missing - assumed
es: %s encabezado falta - supone

source: %s header missing
es: %s encabezado falta

source: Multiple PROGRAM-ID's without matching END PROGRAM
es: Multiples PROGRAM-ID sin pareo de END PROGRAM

source: Executable requested but no program found
es: Ejecutables solicitado, pero no encontró el programa

source: END PROGRAM '%s' is different to PROGRAM-ID '%s'
es: END PROGRAM '%s' es diferente a PROGRAMA-ID '%s'

source: END FUNCTION '%s' is different to FUNCTION-ID '%s'
es: END FUNCTION '%s' es diferente a FUNCTION-ID '%s'

source: FUNCTION-ID is not yet implemented
es: FUNCTION-ID aún no está implementado

source: COMMON may only be used in a contained program
es: COMMON solamente puede ser utilizado en un programa contenido

source: CONFIGURATION SECTION not allowed in nested programs
es: CONFIGURATION SECTION no es permitido en programas anidados

source: Phrases in non-standard order
es: Frases no en order estándar

source: Duplicate CLASSIFICATION clause
es: Cláusula CLASSIFICATION duplicado

source: SPECIAL-NAMES not allowed in nested programs
es: SPECIAL-NAMES no esta permitido en programas anidados

source: Invalid system-name '%s'
es: Inválido nombre de sistema '%s'

source: Invalid CRT clause
es: Inválida cláusula CRT

source: Invalid special names clause
es: Inválida la cláusula de nombres especiales

source: Invalid SYMBOLIC clause
es: Inválida cláusula SYMBOLIC

source: CLASS literal with THRU must have size 1
es: CLASS literal con THRU debe tener un tamaño de 1

source: Invalid currency sign '%s'
es: Inválido signo de moneda '%s'

source: RECORD description invalid with REPORT
es: Descripción RECORD inválida con REPORT

source: RECORD description missing or invalid
es: Descripción de RECORD faltando o inválida

source: File cannot have both EXTERNAL and GLOBAL clauses
es: Archivo no puede tener ambas clausulas EXTERNAL y GLOBAL

source: RECORD clause ignored for LINE SEQUENTIAL
es: Clausula RECORD ignorado para LINE SEQUENTIAL

source: RECORD clause invalid
es: Cláusula de RECORD inválido

source: LINAGE clause with wrong file type
es: Cláusula LINAGE con tipo de archivo equivocado

source: CODE-SET clause invalid for file type
es: Cláusula CODE-SET inválida para tipo de archivo

source: Alphabet-name is expected '%s'
es: Nombre de alfabeta es esperado '%s'

source: Ignoring CODE-SET '%s'
es: Ignorando CODE-SET '%s'

source: REPORT WRITER not implemented
es: REPORT WRITER no esta implementado

source: REPORT clause with wrong file type
es: Cláusula de REPORT con el tipo de archivo equivocado

source: Item requires a data name
es: Elemento requiere nombre de datos

source: CONSTANT item not at 01 level
es: Elemento CONSTANTE no en el nivel 01

source: REDEFINES clause should follow entry-name
es: Clausula de REDEFINES debería seguir nombre de entrada

source: REDEFINES clause must follow entry-name
es: Clausula de REDEFINES debe seguir nombre de entrada

source: EXTERNAL not allowed here
es: EXTERNO no permitido aquí

source: EXTERNAL only allowed at 01/77 level
es: EXTERNO solamente se permite a nivel 01/77

source: EXTERNAL requires a data name
es: EXTERNAL requiere nombre de datos

source: GLOBAL and EXTERNAL are mutually exclusive
es: GLOBAL y EXTERNAL son mutuamente excluyentes

source: BASED and EXTERNAL are mutually exclusive
es: BASED y EXTERNAL son mutuamente excluyentes

source: EXTERNAL and REDEFINES are mutually exclusive
es: EXTERNAL y REDEFINES son mutuamente excluyentes

source: EXTERNAL and OCCURS are mutually exclusive
es: EXTERNAL y OCCURS son mutuamente excluyentes

source: GLOBAL only allowed at 01/77 level
es: GLOBAL solamente se permite a nivel 01/77

source: GLOBAL requires a data name
es: GLOBAL requiere nombre de datos

source: GLOBAL not allowed here
es: GLOBAL no permitido aquí

source: BASED and OCCURS are mutually exclusive
es: BASED y OCCURS son mutuamente excluyentes

source: BASED not allowed here
es: BASED no se permite aquí

source: BASED only allowed at 01/77 level
es: BASED solamente permitido a nivel 01/77

source: BASED requires a data name
es: BASED requiere nombre de datos

source: BASED and REDEFINES are mutually exclusive
es: BASED y REDEFINES son mutuamente excluyentes

source: BASED and ANY LENGTH are mutually exclusive
es: BASED y ANY LENGTH son mutuamente excluyentes

source: FALSE clause only allowed for 88 level
es: Cláusula FALSE sólo se permite para nivel 88

source: RENAMES may not reference a level 01 or > 50
es: RENAMES no puede hacer referencia un nivel 01 o > 50
