Repository: ayumin/open-cobol
Catalog: branches/gnu-cobol-cpp/po/*.po
Languages: es

source: SET targets must be PROGRAM-POINTER
es: Destinos de SET deben ser PROGRAM-POINTER

source: The address of '%s' cannot be changed
es: La dirección de '%s' no puede ser cambiada

source: SET target is invalid - '%s'
es: SET objetivo no es válido - '%s'

source: Invalid SET statement
es: Declaración inválida de SET

source: Field does not have FALSE clause
es: Campo no tiene cláusula FALSE

source: SET ATTRIBUTE requires a screen item as subject
es: SET ATTRIBUTE requiere un nombre de registro como sujeto

source: SET ATTRIBUTE subject does not refer to a screen item
es: SET ATTRIBUTE sujeto no hace referencia a un punto en la pantalla

source: Invalid SORT filename
es: Nombre de archivo para SORT inválido

source: Invalid SORT USING parameter
es: Parámetro inválido en SORT USING

source: Invalid SORT GIVING parameter
es: Parámetro inválido en SORT GIVING

source: Invalid key item
es: Elemento clave inválido

source: START not allowed on SEQUENTIAL files
es: START no permitido en archivos SEQUENTIAL

source: LENGTH/SIZE clause only allowed on INDEXED files
es: Clásula LENGTH/SIZE solamente permitida en archivos INDEXED

source: WRITE requires a record name as subject
es: WRITE requiere un nombre de récord como sujeto

source: WRITE subject does not refer to a record name
es: Sujeto a WRITE no hace referencia a un nombre de récord

source: LOCK clause invalid here
es: Cláusula LOCK inválida aquí

source: Warn if obsolete features are used
es: Alerte si prestaciones obsoletas son utilizadas

source: Warn if archaic features are used
es: Alerte si prestaciones arcaicas son utilizadas

source: Warn incompatible redefinition of data items
es: Alerta incompatible redefinicion de elementos de datos

source: Warn inconsistent constant
es: Advertencia constante inconsistente

source: Warn overlapping MOVE items
es: Alerta elementos MOVE soberpuestos

source: Warn lack of parentheses around AND within OR
es: Alerta falta de paréntesis alrededor de AND dentro de OR

source: Warn type mismatch strictly
es: Alerta no coincide el tipo estritamente

source: Warn implicitly defined data items
es: Alerta implicitamente define los elementos de datos

source: Warn CORRESPONDING with no matching items
es: Alerta CORRESPONDING con elementos no igualados

source: Warn EXTERNAL item with VALUE clause
es: Alerta elemento EXTERNAL con cláusula de VALUE

source: Warn non 01/77 items for CALL params
es: Alerta elementos no 01/77 para params de CALL

source: Warn text after column 72, FIXED format
es: Advertencia texto después de columna 72, formato FIXED

source: Warn lack of scope terminator END-XXX
es: Alerta falta de alcance de terminación END-XXX

source: Warn possible field truncation
es: Advertencia posible truncamiento de campo

source: Warn dangling LINKAGE items
es: Alerta elemento de LINKAGE colgado

source: Warn unreachable statements
es: Advertencia declaraciones inalcanzables

source: Cannot find module
es: No puede encontrar módulo

source: Cannot find entry point
es: No puede encontrar punto de entrada

source: Indeterminable error
es: Error indeterminable

source: NULL parameter passed to 'cob_cancel'
es: Parámetro NULL pasado a ‘cob_cancel’

source: Invalid number of arguments to 'cob_call'
es: Número inválido de argumentos a ‘cob_call’

source: NULL name parameter passed to 'cob_call'
es: Parámetro de nombre NULL pasado a ‘cob_call’

source: NULL parameter passed to 'cob_savenv'
es: Parámetro NULL pasado a ‘cob_savenv’

source: Multiple call to 'cob_setjmp'
es: Llamado multiple a 'cob_setjmp'

source: NULL parameter passed to 'cob_longjmp'
es: Parámetro NULL pasado a ‘cob_longjmp’

source: Call to 'cob_longjmp' with no prior 'cob_setjmp'
es: Llamada a ‘cob_longjmp’ con no previo ‘cob_setjmp’

source: Abnormal termination - File contents may be incorrect
es: Terminación anormal - Contenidos de archivo pueden estar incorrectos

source: Malloc error
es: Error en malloc

source: cob_init() has not been called
es: cob_init() no ha sido llamado

source: Attempt to CANCEL active program
es: Intento de CANCEL programa activo

source: Codegen error - Please report this
es: Error en codegen - Por favor reporte esto

source: Recursive call of chained program
es: Llamada recursiva de programa encadenado

source: Stack overflow, possible PERFORM depth exceeded
es: Desbordamiento de montón, posible profundidad excedida de PERFORM

source: Invalid entry/exit in GLOBAL USE procedure
es: Inválida entrada/salida en procedimiento USO GLOBAL

source: Unable to allocate memory
es: Asignación de memoria sin exito

source: Invalid entry into module
es: Entrada a módulo inválida

source: Invalid recursive COBOL CALL
es: Inválido COBOL CALL recursivo

source: End of file
es: Fin del archivo

source: Key out of range
es: Clave fuera de rango

source: Key order not ascending
es: Orden de clave no es ascendente

source: Record key already exists
es: Clave de registro ya existe

source: Record key does not exist
es: Clave de registro no existe

source: Permanent file error
es: Error permanente de archivo

source: File does not exist
es: No existe archivo

source: Permission denied
es: Permiso negado

source: File already open
es: Archivo ya abierto

source: File not open
es: Archivo no abierto

source: READ must be executed first
es: READ debe ser executada primero

source: Record overflow
es: Desbordamiento de registro

source: Failed to read
es: No ha podido leer

source: READ/START not allowed
es: READ/START no son permitidos

source: WRITE not allowed
es: WRITE no es permitido

source: DELETE/REWRITE not allowed
es: DELETE/REWRITE no son permitidos

source: Record locked by another file connector
es: Registro bloqueado por otro conector de archivo

source: LINAGE values invalid
es: Valores de LINAGE inválido

source: File sharing conflict
es: Conflicto al compartir archivo

source: Runtime library is not configured for this operation
es: Bibloteca de ejecución no está configurado para esta operación

source: Unknown file error
es: Error desconocido de archivo

source: %s (Status = %02d) File : '%s'
es: %s (Estado = %02d) Archivo : ‘%s’

source: Attempt to use non-implemented function
es: Intento de usar función no implementada

source: Unknown failure : %d
es: Fracaso desconocido : %d

source: Error - Version mismatch
es: Error - Conflicto de versión

source: %s has version/patch level %s/%d
es: %s tiene versión/nivel de parche %s/%d

source: Library has version/patch level %s/%d
es: Biblioteca tiene versión/nivel de parche %s/%d

source: CALL to %s requires %d parameters
es: CALL para %s requiere parámetros %d

source: BASED/LINKAGE item '%s' has NULL address
es: Elemento BASED/LINKAGE ‘%s’ tiene dirección NULL

source: '%s' not numeric: '%s'
es: '%s' no es numerico: '%s'

source: OCCURS DEPENDING ON '%s' out of bounds: %d
es: OCCURS DEPENDING ON ‘%s’ fuera de limite: %d

source: EXTERNAL item '%s' previously allocated with size %d, requested size is %d
es: Elemento EXTERNAL ‘%s’ previamente asignado con tamaño %d, tamaño pedido es %d

source: 'cobcommandline' - Runtime has not been initialized
es: ‘cobcommandline’ - Ejecución no se ha inicializado

source: Parameter to SYSTEM call is larger than 8192 characters
es: Parámetro para llamada de SYSTEM es mayor de 8192 caractéres

source: BDB error: %s
es: Error BDB: %s

source: BDB error: %s %s
es: Error BDB: %s %s

source: Cannot join BDB environment, error: %d %s
es: No se puede unir a ambiente BDB, error: %d %s

source: Cannot join BDB environment, env_open: %d %s
es: No se puede unir a ambiente BDB, env_open: %d %s

source: 'CBL_CHECK_FILE_EXIST' - File detail area is too short
es: 'CBL_CHECK_FILE_EXIST' - Área de detalle de archivo es demasiada pequeña

source: 'C$FILEINFO' - File detail area is too short
es: 'C$FILEINFO' - Área de detalle de archivo es demasiada pequeña

source: SORT is unable to acquire temporary file
es: SORT no puede obtener archivo temporal

source: WARNING - Implicit CLOSE of %s ('%s')
es: WARNING - CLOSE implícito de %s ('%s')

source: Failed to initialize curses
es: Fracaso en inicializar cursores

source: (Not representable)
es: (No representable)

source: Usage: cobcrun PROGRAM [param ...]
es: Uso: cobcrun PROGRAM [param …]

source: Print this help
es: Imprimir esta ayuda

source: or : cobcrun --version (-V)
es: o : cobcrun --version (-V)

source: Print version information
es: Imprimir la información de versión

source: or : cobcrun --info (-i)
es: o : cobcrun --info (-i)

source: Print build information
es: Imprimir la información de la generación

source: Memory allocation failure
es: Fracaso en asignación de memoria

source: Invalid option
es: Opción inválida

source: PROGRAM name exceeds 31 characters
es: Nombre de PROGRAM excede 31 caractéres
