Repository: ayumin/open-cobol
Catalog: branches/gnu-cobol-2.0/po/*.po
Languages: nl

source: Invalid %s parameter
nl: Ongeldige %s parameter

source: Too many errors - Aborting compilation
nl: Teveel fouten - Compilatie wordt afgebroken

source: %s:%d Internal compiler error
nl: %s:%d Interne compiler fout

source: %s:%d Invalid cast from '%s' type %s to type %s
nl: %s:%d Ongeldige wijziging van '%s' type %s naar type %s

source: Cannot allocate %d bytes of memory - Aborting
nl: Kan geen %d bytes geheugen verkrijgen - Afbreken

source: Call to %s with NULL pointer
nl: Aanroep van %s met NULL pointer

source: Cannot reallocate %d bytes of memory - Aborting
nl: Kan geen %d bytes geheugen verkrijgen - Afbreken

source: Attempt to reallocate non-allocated memory - Aborting
nl: Poging om niet geïnitialiseerd geheugen te verkrijgen - Afbreken

source: Warning - Assuming literal for unquoted '%s'
nl: Waarschuwing - Aanname constante voor '%s' zonder aanhalingstekens

source: - Length is < 1 or > 31
nl: - Lengte is < 1 of > 31

source: - Name cannot begin with space or underscore
nl: - Naam mag niet beginnen met spatie of underscore

source: - Name cannot begin with 'cob_' or 'COB_'
nl: - Naam mag niet beginnen met 'cob_' of 'COB_'

source: - Name duplicates a 'C' keyword
nl: - Naam is een 'C' gereserveerd woord

source: - Name cannot contain a directory separator
nl: - Naam mag geen map scheidingsteken bevatten

source: Invalid file base name '%s'%s
nl: Ongeldige bestandsnaam '%s'%s

source: Invalid ENTRY '%s'%s
nl: Ongeldige ENTRY '%s'%s

source: Invalid PROGRAM-ID '%s'%s
nl: Ongeldige PROGRAM-ID '%s'%s

source: Unknown name error '%s'%s
nl: Onbekende naam fout '%s'%s

source: Error:
nl: Fout:

source: Duplicate define '%s' - Ignoring
nl: Dubbele definitie '%s' - Negeren

source: Parameter buffer size exceeded
nl: Parameter buffer grootte overschreden

source: Warning - Could not move temporary file to %s
nl: Waarschuwing - Kon tijdelijk bestand niet verplaatsen naar %s

source: Aborting compile of %s at line %d
nl: Afbreken compilatie van %s bij regel %d

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
nl: Dit is vrij beschikbare software; zie de bron code voor de kopieer condities. Er is GEEN garantie en geen toestemming voor verkoop. Ook niet voor een bepaalde toepassing.

source: Built %s
nl: Gebouwd %s

source: Packaged %s
nl: Verpakt %s

source: C version %s%s
nl: C versie %s%s

source: Executing:
nl: Uitvoeren:

source: Build information
nl: Bouw informatie

source: Build environment
nl: Bouw omgeving

source: Dynamic loading
nl: Dynamisch laden

source: System
nl: Systeem

source: Enabled
nl: Ingeschakeld

source: Disabled
nl: Uitgeschakeld

source: Variable format
nl: Variabel formaat

source: Sequential handler
nl: Sequentiële handler

source: External
nl: Extern

source: Internal
nl: Intern

source: C-ISAM (Experimental)
nl: C-ISAM (Experimenteel)

source: D-ISAM (Experimental)
nl: D-ISAM (Experimenteel)

source: VBISAM (Experimental)
nl: VBISAM (Experimenteel)

source: - NOT set with -Wall
nl: NIET gezet met -Wall

source: Usage: cobc [options] file ...
nl: Gebruik: cobc [opties] bestand ...

source: Options:
nl: Opties:

source: -help Display this message
nl: -help Toont deze boodschap

source: -version, -V Display compiler version
nl: -version, -V Toont compiler verse

source: -v Display the commands invoked by the compiler
nl: -v Toont de opdrachten uitgevoerd door de compiler

source: -x Build an executable program
nl: -x Bouw een uitvoerbaar programma

source: -m Build a dynamically loadable module (default)
nl: -m Bouw een dynamisch laadbare module (standaard)

source: -std=<dialect> Warnings/features for a specific dialect :
nl: -std=<dialect> Waarschuwingen/kenmerken van een specifiek dialect :

source: ibm IBM Compatible
nl: ibm IBM Compatibel

source: mvs MVS Compatible
nl: mvs MVS Compatibel

source: bs2000 BS2000 Compatible
nl: bs2000 BS2000 Compatibel

source: mf Micro Focus Compatible
nl: mf Micro Focus Compatibel

source: default When not specified
nl: standaard Wanneer niet opgegeven

source: See config/default.conf and config/*.conf
nl: Zie config/default.conf en config/*.conf

source: -free Use free source format
nl: -free Gebruik vrij bron formaat

source: -fixed Use fixed source format (default)
nl: -fixed Gebruik vast bron formaat (standaard)

source: -O, -O2, -Os Enable optimization
nl: -O, -O2, -Os Inschakelen optimalisatie

source: -g Enable C compiler debug / stack check / trace
nl: -g Inschakelen C compiler debug / stack check / trace

source: -debug Enable all run-time error checking
nl: -debug Inschakelen alle run-time fout controles

source: -o <file> Place the output into <file>
nl: -o <bestand> Plaats de uitvoer in <file>

source: -b Combine all input files into a single
nl: -b Combineer alle invoer bestanden in één bestand

source: dynamically loadable module
nl: dynamisch laadbare module

source: -E Preprocess only; do not compile or link
nl: -E Alleen voorbewerken; niet compileren of linken

source: -C Translation only; convert COBOL to C
nl: -C Alleen vertalen; converteer COBOL naar C

source: -S Compile only; output assembly file
nl: -S Alleen compileren; uitvoer assembler bestand

source: -c Compile and assemble, but do not link
nl: -c Compileer en assembleer, maar niet linken

source: -P(=<dir or file>) Generate preprocessed program listing (.lst)
nl: -P(=<map of bestand>) Genereer voorbewerkte programma lijst (.lst)

source: -Xref Generate cross reference through 'cobxref'
nl: -Xref Genereer kruisverwijzing door 'cobxref'

source: (V. Coen's 'cobxref' must be in path)
nl: (V. Coen's 'cobxref' moet in het pad staan

source: -I <directory> Add <directory> to copy/include search path
nl: -I <map> Voeg <map> toe aan copy/include zoek pad

source: -L <directory> Add <directory> to library search path
nl: -L <map> Voeg <map> toe aan library zoek pad

source: -l <lib> Link the library <lib>
nl: -l <bibliotheek> Link de bibliotheek <lib>

source: -A <options> Add <options> to the C compile phase
nl: -A <opties> Voeg <opties> toe aan de C compileer fase

source: -Q <options> Add <options> to the C link phase
nl: -Q <opties> Voeg <opties> toe aan de C link fase

source: -D <define> DEFINE <define> to the COBOL compiler
nl: -D <woord> Maak <woord> bekend bij de COBOL compiler

source: -K <entry> Generate CALL to <entry> as static
nl: -K <ingang> Genereer aanroep van <ingang> als statisch

source: -conf=<file> User defined dialect configuration - See -std=
nl: -conf=<bestand> Gebruiker gedefinieerde dialect configuratie - Zie -std=

source: -list-reserved Display reserved words
nl: -list-reserved Toon gereserveerde woorden

source: -list-intrinsics Display intrinsic functions
nl: -list-intrinsics Toon intrinsieke functies

source: -list-mnemonics Display mnemonic names
nl: -list-mnemonics Toon mnemonic namen

source: -list-system Display system routines
nl: -list-system Toon systeem routines

source: -save-temps(=<dir>) Save intermediate files
nl: -save-temps(=<map>) Bewaar tijdelijke bestanden

source: - Default : current directory
nl: - STandaard : huidige map

source: -ext <extension> Add default file extension
nl: -ext <suffix> Voeg standaard bestands suffix toe

source: -W Enable ALL warnings
nl: -W Inschakelen alle waarschuwingen

source: -Wall Enable all warnings except as noted below
nl: -Wall Inschakelen alle waarschuwingen behalve zoals vermeld hieronder

source: Only one of options %s may be specified
nl: Alleen één van de opties %s mag worden opgegeven

source: '%s' is not an intrinsic function
nl: '%s' is geen interne compiler functie

source: Invalid output file name
nl: Ongeldige uitvoer bestandsnaam

source: Invalid option -std=%s
nl: Ongeldige optie -std=%s

source: Warning - '%s' is not a directory, defaulting to current directory
nl: Waarschuwing - '%s' is geen map, huidige map wordt gebruikt

source: Warning - assuming '%s' is a DEFINE - did you intend to use -debug?
nl: Waarschuwing - aangenomen wordt dat '%s' een DEFINE is - bedoelt u -debug?

source: Invalid option detected
nl: Ongeldige optie gevonden

source: Failed to load the initial config file
nl: Laden eerste configuratie bestand mislukt

source: Invalid tab-width value - %d
nl: Ongeldige waarde voor tab-breedte - %d

source: Invalid text-column value - %d
nl: Ongeldige tekst-kolom waarde - %d

source: Invalid file name parameter
nl: Ongeldige bestandsnaam parameter

source: Unknown option ignored: %s
nl: Onbekende optie genegeerd: %s

source: Return status:
nl: Retour status:

source: Preprocessing:
nl: Voorverwerking:

source: 'cobxref' execution unsuccessful
nl: Uitvoering 'xcobref' mislukt

source: Check that 'cobxref' is in %s
nl: Controleer of 'xcobref' voorkomt in %s

source: No listing produced
nl: Geen lijst gemaakt

source: Parsing:
nl: Ontleden:

source: Translating:
nl: Vertalen:

source: No input files
nl: Geen invoer bestanden

source: -o option invalid in this combination
nl: -o optie ongeldig bij deze combinatie

source: Unexpected CONSTANT item
nl: Onverwacht CONSTANT item

source: Unexpected tree tag %d
nl: Onverwacht boom label %d

source: Unexpected cast type %d
nl: Onverwacht wijzigings type %d

source: Internal statement stack depth exceeded -> %d
nl: Interne statement stapel diepte overschreden -> %d

source: Unexpected function %s
nl: Onverwachte functie %s

source: Unexpected constant
nl: Onverwachte constante

source: Unexpected tree category %d
nl: Onverwachte boom categorie %d

source: Unexpected size
nl: Onverwachte grootte

source: Unexpected error_node parameter
nl: Onverwachte error_node parameter

source: Unexpected tree type %d
nl: Onverwacht boom type %d

source: Unexpected optimization value
nl: Onverwachte optimalisatie waarde

source: Invalid value for '%s'
nl: Ongeldige waarde voor '%s'

source: '%s' not supported
nl: '%s' niet ondersteund

source: No such file or directory
nl: Onbekend bestand of map

source: Invalid line
nl: Ongeldig regelnummer

source: Unknown tag '%s'
nl: Onbekend label '%s'

source: Invalid type for '%s'
nl: Ongeldig type voor '%s'

source: %s: No definition of '%s'
nl: %s: Geen definitie voor '%s'

source: In section
nl: In sectie

source: In paragraph
nl: In paragraaf

source: Warning:
nl: Waarschuwing:

source: %s is archaic in %s
nl: %s is verouderd in %s

source: %s is obsolete in %s
nl: %s is overbodig in %s

source: %s ignored
nl: %s genegeerd

source: %s does not conform to %s
nl: %s is niet in overeenstemming met %s

source: Redefinition of '%s'
nl: Herdefinitie van '%s'

source: '%s' previously defined here
nl: '%s' eerder gedefinieerd hier

source: %s is not defined
nl: %s is niet gedefinieerd

source: %s ambiguous; need qualification
nl: %s onduidelijk; specificeer nader

source: defined here
nl: hier gedefinieerd

source: Group item '%s' cannot have %s clause
nl: Groeps item '%s' kan geen %s clausule hebben

source: Constant item '%s' cannot have a %s clause
nl: Constante item '%s' kan geen %s clausule hebben

source: Level %02d item '%s' cannot have a %s clause
nl: Nivo %02d item '%s' kan geen a %s clausule hebben

source: Constant item '%s' requires a %s clause
nl: Constante item '%s' verwacht een %s clausule

source: Level %02d item '%s' requires a %s clause
nl: Level %02d item '%s' verwacht een %s clausule

source: Constant item '%s' can only have a %s clause
nl: Constante item '%s' kan alleen een %s clausule hebben

source: Level %02d item '%s' can only have a %s clause
nl: Nivo %02d item '%s' kan alleen een %s clausule hebben

source: Invalid level number '%s'
nl: Ongeldig nivo nummer '%s'

source: Level number must begin with 01 or 77
nl: Nivo nummer moet beginnen met 01 of 77

source: No previous data item of level %02d
nl: Geen eerder data item met nivo %02d

source: '%s' cannot be qualified here
nl: '%s' kan hier niet worden gespecificeerd

source: '%s' cannot be subscripted here
nl: '%s' kan hier niet worden geïndexeerd

source: '%s' is not defined in '%s'
nl: '%s' is niet gedefinieerd in '%s'

source: Level number of REDEFINES entries must be identical
nl: Nivo nummer van REDEFINES beschrijvingen moet gelijk zijn

source: Level number of REDEFINES entry cannot be 66 or 88
nl: Nivo nummer van REDEFINES beschrijving mag geen 66 of 88 zijn

source: '%s' not the original definition
nl: '%s' niet de originele definitie

source: BLANK ZERO not compatible with USAGE
nl: BLANK ZERO niet compatibel met USAGE

source: SIGN clause not compatible with USAGE
nl: SIGN clause niet compatibel met USAGE

source: PICTURE clause required for '%s'
nl: PICTURE clausule verplicht voor '%s'

source: A non-numeric literal is expected for '%s'
nl: Een niet numerieke constante is verwacht voor '%s'

source: Defining implicit picture size %d for '%s'
nl: Aannemen impliciete opmaak grootte %d voor '%s'

source: '%s' ANY LENGTH only allowed in LINKAGE
nl: '%s' ANY LENGTH alleen toegestaan in LINKAGE

source: '%s' ANY LENGTH must be 01 level
nl: '%s' ANY LENGTH moet 01 nivo zijn

source: '%s' ANY LENGTH can not be BASED/EXTERNAL
nl: '%s' ANY LENGTH kan niet in BASED/EXTERNAL

source: '%s' ANY LENGTH has invalid definition
nl: '%s' ANY LENGTH heeft ongeldige definitie

source: '%s' ANY LENGTH must have a PICTURE
nl: '%s' ANY LENGTH moet een PICTURE hebben

source: '%s' 77 level not allowed here
nl: '%s' 77 nivo hier niet toegestaan

source: '%s' EXTERNAL must be specified at 01/77 level
nl: '%s' EXTERNAL moet op 01/77 nivo worden gespecificeerd

source: '%s' EXTERNAL can only be specified in WORKING-STORAGE section
nl: '%s' EXTERNAL kan alleen in WORKING-STORAGE sectie worden gespecificeerd

source: '%s' EXTERNAL and BASED are mutually exclusive
nl: '%s' EXTERNAL en BASED sluiten elkaar uit

source: '%s' EXTERNAL not allowed with REDEFINES
nl: '%s' EXTERNAL niet toegestaan met REDEFINES

source: '%s' BASED not allowed here
nl: '%s' BASED niet toegestaan hier

source: '%s' BASED not allowed with REDEFINES
nl: '%s' BASED niet toegestaan met REDEFINES

source: '%s' BASED only allowed at the 01 and 77 levels
nl: '%s' BASED alleen toegestaan op 01 en 77 nivo's

source: '%s' cannot have the OCCURS clause due to '%s'
nl: '%s' OCCURS clausule kan niet vanwege '%s'

source: The original definition '%s' should not have OCCURS
nl: De originele definitie '%s' mag geen OCCURS hebben

source: REDEFINES must follow the original definition
nl: REDEFINES moet na de originele definitie

source: '%s' cannot be variable length
nl: '%s' kan geen variabele lengte zijn

source: The original definition '%s' cannot be variable length
nl: De originele definitie '%s' kan geen variabele lengte zijn

source: SCREEN group item '%s' has invalid clause
nl: SCREEN groeps item '%s' heeft ongeldige clausule

source: '%s' cannot have PICTURE clause
nl: '%s' kan geen PICTURE clausule hebben

source: '%s' PICTURE clause not compatible with USAGE
nl: '%s' PICTURE clausule niet compatibel met USAGE

source: '%s' COMP-6 with sign - Changing to COMP-3
nl: '%s' COMP-6 met teken - Gewijzigd naar COMP-3

source: '%s' cannot have JUSTIFIED RIGHT
nl: '%s' kan geen JUSTIFIED RIGHT zijn

source: '%s' cannot have BLANK WHEN ZERO
nl: '%s' kan geen BLANK WHEN ZERO zijn

source: Only level 88 item may have multiple values
nl: Alleen nivo 88 item mag meerdere waarden hebben

source: Entries under REDEFINES cannot have a VALUE clause
nl: Beschrijvingen onder REDEFINES kunnen geen VALUE clausule hebben

source: Initial VALUE clause ignored for EXTERNAL item
nl: Eerste VALUE clausule genegeerd voor EXTERNAL item

source: Ignoring SYNCHRONIZED for group item '%s'
nl: SYNCHRONIZED genegeerd voor groep item '%s'

source: Size of '%s' larger than size of '%s'
nl: Lengte van '%s' groter dan lengte van '%s'

source: '%s' binary field cannot be larger than %d digits
nl: '%s' binair veld kan niet groter zijn dan %d cijfers

source: Unexpected USAGE - %d
nl: Onbekende USAGE - %d

source: Literal type does not match data type
nl: Constante type komt niet overeen met data type

source: Define PERFORM stack size - Default : 255
nl: Definieer PERFORM stapel grootte - Standaard : 255

source: Define cutoff depth for IF statements - Default : 3
nl: Definieer afbreek diepte voor IF statements - Standaards : 3

source: Define display sign representation - ASCII or EBCDIC (Default : machine native)
nl: Definieer display teken representatie - ASCII of EBCDIC (Standaard : machine native)

source: Fold COPY subject to value - UPPER or LOWER (Default : no transformation)
nl: Transformeer COPY naar waarde - UPPER of LOWER (Standaard : geen transformatie)

source: Fold PROGRAM-ID, CALL, CANCEL subject to value - UPPER or LOWER (Default : no transformation)
nl: Transformeer PROGRAM-ID, CALL, CANCEL naar waarde - UPPER of LOWER (Standaard : geen transformatie)

source: Initialize fields without VALUE to decimal value - 0 to 255 (Default : initialize to picture)
nl: Initialiseer velden zonder VALUE naar numerieke waarde - 0 to 255 (Standaard : initialiseer naar opmaak)

source: Intrinsics to be used without FUNCTION keyword - ALL or intrinsic function name (,name,...)
nl: Ingebouwde functie moet gebruikt worden zonder FUNCTION sleutelwoord - ALL of ingebouwde functienaam (,naam,...)

source: Output static function calls for the CALL statement
nl: Uitvoer statische functie roept een CALL statement aan

source: Generate computed goto C statements
nl: Genereer berekende goto C statements

source: Use restricted ASCII to EBCDIC translate
nl: Gebruik beperkte ASCII naar EBCDIC vertaling

source: Generate extra braces in generated C code
nl: Genereer extra accolades in gegenereerde C code

source: Attempt correction of invalid numeric display items
nl: Probeer fouten in numerieke display items te corrigeren

source: PERFORM stack allocated on heap
nl: PERFORM stapel gealloceerd in dynamisch geheugen

source: Generate trace code - Executed SECTION/PARAGRAPH
nl: Genereer trace code - SECTIE/PARAGRAAF uitgevoerd

source: Generate trace code - Executed SECTION/PARAGRAPH/STATEMENTS - Turned on by -debug
nl: Genereer trace code - SECTIE/PARAGRAAF/STATEMENTS uitgevoerd - Ingeschakeld door -debug

source: Syntax error checking only; don't emit any output
nl: Alleen syntaxis fout controle; maak geen uitvoer

source: Enable debugging lines - 'D' in indicator column or floating >>D
nl: Inschakelen debugging regels - 'D' in indicator kolom of zwervende >>D

source: Generate source location code - Turned on by -debug/-g/-ftraceall
nl: Genereer bron locatie code - Ingeschakeld door -debug/-g/-ftraceall

source: Automatic initialization of the Cobol runtime system
nl: Automatische initialisatie van het Cobol runtime systeem

source: PERFORM stack checking - Turned on by -debug or -g
nl: Doe stapel controle - Ingeschakeld door -debug of -g

source: Allow syntax extensions - eg. Switch name SW1, etc.
nl: Sta syntaxis extensies toe - bv. Switch naam SW1, etc.

source: Use AFTER 1 for WRITE of LINE SEQUENTIAL - Default : BEFORE 1
nl: Gebruik AFTER 1 voor WRITE bij LINE SEQUENTIAL - Standaard : BEFORE 1

source: '*' or '/' in column 1 treated as comment - FIXED format only
nl: Zie '*' of '/' in kolom 1 als commentaar - Alleen bij vast formaat

source: Allow numeric field overflow - Non-ANSI behaviour
nl: Sta overloop toe in numerieke velden - Non-ANSI gedrag

source: Adjust items following OCCURS DEPENDING - Requires implicit/explicit relaxed syntax
nl: Wijzig items na OCCURS DEPENDING - Vereist impliciete/expliciete versoepelde syntaxis

source: Use a single quote (apostrophe) for QUOTE - Default : double quote
nl: Gebruik een enkel aanhalingsteken (apostrof) voor QUOTE - Standaard : dubbel aanhalingsteken

source: Check recursive program call
nl: Controleer recursieve programma aanroep

source: Relax syntax checking - eg. REDEFINES position
nl: Versoepel syntaxis controle - bv. REDEFINES positie

source: Treat all files as OPTIONAL - unless NOT OPTIONAL specified
nl: Behandel alle bestanden als OPTIONAL - tenzij NOT OPTIONAL is gespecificeerd

source: '%s' not implemented
nl: '%s' niet geïmplementeerd

source: Unreachable statement '%s'
nl: Statement wordt niet bereikt '%s'

source: '%s' not level 01 or 77
nl: '%s' niet nivo 01 of 77

source: '%s' is not in LINKAGE SECTION
nl: '%s' is niet in LINKAGE SECTION

source: '%s' can not be BASED/EXTERNAL
nl: '%s' mag niet BASED/EXTERNAL zijn

source: '%s' is not in WORKING-STORAGE SECTION
nl: '%s' is niet in WORKING-STORAGE SECTION

source: '%s' REDEFINES field not allowed here
nl: '%s' REDEFINES veld hier niet toegestaan

source: LINKAGE item '%s' is not a PROCEDURE USING parameter
nl: LINKAGE item '%s' is niet een PROCEDURE USING parameter

source: '%s' USING item duplicates RETURNING item
nl: '%s' USING item multipliceert RETURNING item

source: ENTRY '%s' duplicated
nl: ENTRY '%s' dubbel

source: Maximum nested program depth exceeded (%d)
nl: Maximum aantal insluitende programma's overschreden (%d)

source: %s statement not terminated by END-%s
nl: %s statement niet afgesloten met END-%s

source: USE statement invalid for SORT file
nl: USE statement ongeldig voor SORT bestand

source: Duplicate %s clause
nl: Dubbele %s clausule

source: %s header missing - assumed
nl: %s kop ontbreekt - veronderstelt

source: %s header missing
nl: %s kop ontbreekt

source: Multiple PROGRAM-ID's without matching END PROGRAM
nl: Meerdere PROGRAM-ID's zonder bijbehorend END PROGRAM

source: Executable requested but no program found
nl: Uitvoerbaar programma gevraagd maar geen programma gevonden

source: END PROGRAM '%s' is different to PROGRAM-ID '%s'
nl: END PROGRAM '%s' verschilt met PROGRAM-ID '%s'

source: END FUNCTION '%s' is different to FUNCTION-ID '%s'
nl: END FUNCTION '%s' verschilt met FUNCTION-ID '%s'

source: COMMON may only be used in a contained program
nl: COMMON mag alleen worden gebruikt in een bijgesloten programma

source: %s not allowed in nested programs
nl: %s niet toegestaan in ingesloten programma's

source: Phrases in non-standard order
nl: Frases in niet-standard volgorde

source: Duplicate CLASSIFICATION clause
nl: Dubbele CLASSIFICATION clausule

source: Invalid system-name '%s'
nl: Ongeldige systeem-naam '%s'

source: Invalid CRT clause
nl: Ongeldige CRT clausule

source: Invalid special names clause
nl: Ongeldige SPECIAL NAMES clausule

source: Invalid SYMBOLIC clause
nl: Ongeldige SYMBOLIC clausule

source: CLASS literal with THRU must have size 1
nl: CLASS constante met THRU moet een grootte van 1 zijn

source: Invalid currency sign '%s'
nl: Ongeldig valuta teken '%s'

source: RECORD description invalid with REPORT
nl: RECORD beschijving ongeldig bij REPORT

source: RECORD description missing or invalid
nl: RECORD beschrijving ontbreekt of ongeldig

source: File cannot have both EXTERNAL and GLOBAL clauses
nl: Bestand kan niet zowel EXTERNAL als GLOBAL clausules hebben

source: RECORD clause ignored for LINE SEQUENTIAL
nl: RECORD clausule genegeerd voor LINE SEQUENTIAL

source: RECORD clause invalid
nl: RECORD clausule ongeldig

source: RECORD size exceeds maximum allowed (%d)
nl: RECORD grootte overschrijdt het toegestane maximum (%d)

source: LINAGE clause with wrong file type
nl: LINAGE clausule met incorrect bestandstype

source: CODE-SET clause invalid for file type
nl: CODE-SET clausule ongeldig voor bestandstype

source: Alphabet-name is expected '%s'
nl: Alphabet-name is verwacht '%s'

source: Ignoring CODE-SET '%s'
nl: CODE-SET '%s' genegeerd

source: REPORT clause with wrong file type
nl: REPORT clausule met incorrect bestandstype

source: Item requires a data name
nl: Item vereist een veld naam

source: CONSTANT item not at 01 level
nl: CONSTANT item niet op 01 nivo

source: REDEFINES clause should follow entry-name
nl: REDEFINES clausule hoort na ENTRY naam te komen

source: REDEFINES clause must follow entry-name
nl: REDEFINES clausule moet na ENTRY naam komen
