Repository: ayumin/open-cobol
Catalog: branches/gnu-cobol-2.0/po/*.po
Languages: nl

source: The targets of SET must be either indexes or pointers
nl: De doelen van SET moeten indices of pointers zijn

source: SET targets must be PROGRAM-POINTER
nl: SET doelen moeten PROGRAM-POINTER zijn

source: The address of '%s' cannot be changed
nl: Het adres van '%s' mag niet gewijzigd worden

source: SET target is invalid - '%s'
nl: SET doel is omgeldig - '%s'

source: Invalid SET statement
nl: Ongeldig SET statement

source: Field does not have FALSE clause
nl: Veld heeft geen FALSE clausule

source: SET ATTRIBUTE requires a screen item as subject
nl: SET ATTRIBUTE vereist een screen item als onderwerp

source: SET ATTRIBUTE subject does not refer to a screen item
nl: SET ATTRIBUTE onderwerp verwijst niet naar een screen item

source: Invalid SORT filename
nl: Ongeldige SORT bestandsnaam

source: Invalid SORT USING parameter
nl: Ongeldige SORT USING parameter

source: Invalid SORT GIVING parameter
nl: Ongeldige SORT GIVING parameter

source: Invalid key item
nl: Ongeldig key item

source: LENGTH/SIZE clause only allowed on INDEXED files
nl: LENGTH/SIZE clausule alleen mogelijk bij INDEXED bestanden

source: START not allowed with ACCESS MODE RANDOM
nl: START niet toegestaan bij ACCESS MODE RANDOM

source: LOCK clause invalid here
nl: LOCK clausule ongeldig hier

source: Warn if obsolete features are used
nl: Waarschuw indien verouderde opties worden gebruikt

source: Warn if archaic features are used
nl: Waarschuw indien verouderde opties worden gebruikt

source: Warn incompatible redefinition of data items
nl: Waarschuw bij incompatibele herdefinitie van data items

source: Warn inconsistent constant
nl: Waarschuw bij inconsistente constanten

source: Warn overlapping MOVE items
nl: Waarschuw bij overlappende MOVE items

source: Warn lack of parentheses around AND within OR
nl: Waarschuw bij ontbrekende haken rond AND binnen OR

source: Warn type mismatch strictly
nl: Waarschuw bij type conflicten

source: Warn implicitly defined data items
nl: Waarschuw bij impliciet gedefinieerde data items

source: Warn CORRESPONDING with no matching items
nl: Waarschuw bij CORRESPONDING met geen bijbehorende items

source: Warn EXTERNAL item with VALUE clause
nl: Waarschuw bij EXTERNAL item met VALUE clausule

source: Warn non 01/77 items for CALL params
nl: Waarschuw bij niet 01/77 items als CALL parameter

source: Warn text after column 72, FIXED format
nl: Waarschuw bij text na kolom 72, FIXED formaat

source: Warn lack of scope terminator END-XXX
nl: Waarschuw bij ontbreken van scope terminator END-XXX

source: Warn possible field truncation
nl: Waarschuw bij mogelijke veld truncatie

source: Warn dangling LINKAGE items
nl: Waarschuw bij zwevende LINKAGE items

source: Warn unreachable statements
nl: Waarschuw bij onbereikbare statements

source: LoadLibrary/GetProcAddress error %d
nl: LoadLibrary/GetProcAddress fout %d

source: Cannot find module
nl: Onvindbare module

source: Cannot find entry point
nl: Onvindbaar ingangspunt

source: Indeterminable error
nl: Onbepaalbare fout

source: User FUNCTION '%s' not found
nl: User FUNCTION '%s' niet gevonden

source: NULL parameter passed to '%s'
nl: NULL parameter doorgegeven aan '%s'

source: Invalid number of arguments to '%s'
nl: Ongeldig aantal argumenten voor %s'

source: Multiple call to 'cob_setjmp'
nl: Meerdere aanroepen van 'cob_setjmp'

source: Call to 'cob_longjmp' with no prior 'cob_setjmp'
nl: Aanroep van 'cob_longjmp' zonder voorafgaande 'cob_setjmp'

source: %s: option `%s' is ambiguous
nl: %s: optie `%s' is onduidelijk

source: %s: option `--%s' doesn't allow an argument
nl: %s: optie `--%s' verwacht geen argument

source: %s: option `%c%s' doesn't allow an argument
nl: %s: optie `%c%s' verwacht geen argument

source: %s: option `%s' requires an argument
nl: %s: optie `%s' verwacht een argument

source: %s: unrecognized option `--%s'
nl: %s: onbekende optie `--%s'

source: %s: unrecognized option `%c%s'
nl: %s: onbekende optie `%c%s'

source: %s: invalid option -- %c
nl: %s: ongeldige optie -- %c

source: %s: option requires an argument -- %c
nl: %s: optie verwacht een argument -- %c

source: %s: option `-W %s' is ambiguous
nl: %s: optie `-W %s' is onduidelijk

source: %s: option `-W %s' doesn't allow an argument
nl: %s: optie `-W %s' verwacht geen argument

source: Abnormal termination - File contents may be incorrect
nl: Abnormaal einde - Bestandsinhoud kan incorrect zijn

source: Malloc error
nl: Malloc fout

source: cob_init() has not been called
nl: cob_init() is niet aangeroepen

source: Attempt to CANCEL active program
nl: CANCEL poging op een actief programma

source: Codegen error - Please report this
nl: Codegen fout - Doorgeven s.v.p.

source: Recursive call of chained program
nl: Recursieve aanroep van chained programma

source: Stack overflow, possible PERFORM depth exceeded
nl: Stack overloop, mogelijke PERFORM diepte overschrijding

source: Invalid entry/exit in GLOBAL USE procedure
nl: Ongeldige entry/exit in GLOBAL USE procedure

source: Unable to allocate memory
nl: Onmogelijk om geheugen te verkrijgen

source: Invalid entry into module
nl: ongeldige ingang in module

source: Invalid recursive COBOL CALL
nl: Ongeldige recursieve COBOL CALL

source: End of file
nl: Einde bestand

source: Key out of range
nl: Key buiten bereik

source: Key order not ascending
nl: Key volgorde niet oplopend

source: Record key already exists
nl: Record key bestaat al

source: Record key does not exist
nl: Record key niet aanwezig

source: Permanent file error
nl: Permanente bestands fout

source: File does not exist
nl: Bestand niet aanwezig

source: Permission denied
nl: Toestemming geweigerd

source: File already open
nl: Bestand is al geopend

source: File not open
nl: Bestand nog niet geopend

source: READ must be executed first
nl: READ moet eerst worden uitgevoerd

source: READ/START not allowed
nl: READ/START niet toegestaan

source: WRITE not allowed
nl: WRITE niet toegestaan

source: DELETE/REWRITE not allowed
nl: DELETE/REWRITE niet toegestaan

source: Record locked by another file connector
nl: Record geblokkeerd door een andere bestands connector

source: LINAGE values invalid
nl: LINAGE waarden ongeldig

source: File sharing conflict
nl: Bestands deling conflict

source: Runtime library is not configured for this operation
nl: Runtime library is niet geconfigureerd voor deze operatie

source: Unknown file error
nl: Onbekende bestands fout

source: %s (Status = %02d) File : '%s'
nl: %s (Status = %02d) Bestand : '%s'

source: Attempt to use non-implemented function
nl: Poging om een niet geïmplementeerde functie te gebruiken

source: Unknown failure : %d
nl: Onbekende storing : %d

source: Error - Version mismatch
nl: Fout - Versie conflict

source: %s has version/patch level %s/%d
nl: %s heeft versie/patch nivo %s/%d

source: Library has version/patch level %s/%d
nl: Library heeft versie/patch nivo %s/%d

source: CALL to %s requires %d parameters
nl: CALL naar %s vereist %d parameters

source: BASED/LINKAGE item '%s' has NULL address
nl: BASED/LINKAGE item '%s' heeft een NULL adres

source: '%s' not numeric: '%s'
nl: '%s' niet numeriek: '%s'

source: OCCURS DEPENDING ON '%s' out of bounds: %d
nl: OCCURS DEPENDING ON '%s' buiten grens: %d

source: EXTERNAL item '%s' previously allocated with size %d, requested size is %d
nl: EXTERNAL item '%s' eerder gemaakt met grootte %d, gevraagde grootte is %d

source: 'cobcommandline' - Runtime has not been initialized
nl: 'cobcommandline' - Runtime is niet geïnitialiseerd

source: Parameter to SYSTEM call is larger than 8192 characters
nl: Parameter voor SYSTEM call is groter dan 8192 karakters

source: Memory allocation failure
nl: Geheugen allocatie storing

source: BDB error: %s
nl: BDB fout: %s

source: BDB error: %s %s
nl: BDB fout: %s %s

source: Cannot join BDB environment, error: %d %s
nl: Kan niet verbinden met BDB omgeving, fout: %d %s

source: Cannot join BDB environment, env_open: %d %s
nl: Kan niet verbinden met BDB omgeving, env_open: %d %s

source: 'CBL_CHECK_FILE_EXIST' - File detail area is too short
nl: 'CBL_CHECK_FILE_EXIST' - Bestandsadministratie geheugen is te klein

source: 'C$FILEINFO' - File detail area is too short
nl: 'C$FILEINFO' - Bestandsadministratie geheugen is te klein

source: SORT is unable to acquire temporary file
nl: SORT kan geen tijdelijk bestand maken

source: WARNING - Implicit CLOSE of %s ('%s')
nl: WAARSCHUWING - Impliciete CLOSE van %s ('%s')

source: Failed to initialize curses
nl: Kan curses niet initialiseren

source: (Not representable)
nl: (Niet representeerbaar)

source: Usage: cobcrun PROGRAM [param ...]
nl: Gebruik: cobcrun PROGRAM [param ...]

source: or : cobcrun options
nl: of : cobcrun opties

source: PROGRAM name exceeds 31 characters
nl: PROGRAM naam overschrijdt 31 karakters
