Repository: ayumin/open-cobol
Catalog: branches/gnu-cobol-2.0/po/*.po
Languages: nl

source: %s not allowed here
nl: %s niet toegestaan hier

source: %s only allowed at 01/77 level
nl: %s alleen toegestaan op 01/77 nivo

source: %s requires a data name
nl: Item %s vereist een veld naam

source: %s and %s are mutually exclusive
nl: %s and %s sluiten elkaar uit

source: Maximum OCCURS depth exceeded (%d)
nl: Maximum OCCURS diepte overschreden (%d)

source: FALSE clause only allowed for 88 level
nl: FALSE clausule alleen voor 88 nivo

source: RENAMES may not reference a level 01 or > 50
nl: RENAMES mag niet verwijzen naar een 01 of > 50 nivo

source: GLOBAL is not allowed with RD
nl: GLOBAL is niet toegestaan met RD

source: Invalid PAGE clause
nl: Ongeldige PAGE clausule

source: INITIAL specified on non-input field
nl: INITIAL gespecificeerd op een niet-invoer veld

source: GLOBAL is not allowed with screen items
nl: GLOBAL is niet toegestaan met scherm items

source: Executable program requested but PROCEDURE/ENTRY has USING clause
nl: Uitvoerbaar programma gevraagd maar PROCEDURE/ENTRY heeft USING clausule

source: Number of parameters exceeds maximum %d
nl: Aantal parameters overschrijdt maximum %d

source: CHAINING invalid in user FUNCTION
nl: CHAINING ongeldig in een FUNCTION

source: %s not allowed in CHAINED programs
nl: %s niet toegestaan in CHAINED programma

source: SIZE only allowed for BY VALUE items
nl: SIZE alleen toegestaan voor BY VALUE items

source: Invalid value for SIZE
nl: Ongeldige waarde voor SIZE

source: OPTIONAL only allowed for BY REFERENCE items
nl: OPTIONAL alleen toegestaan voor BY REFERENCE items

source: RETURNING clause is required for a FUNCTION
nl: RETURNING clausule is verplicht voor FUNCTION

source: RETURNING item must have level 01
nl: RETURNING item moet nivo 01

source: Unknown statement '%s'
nl: Onbekend statement '%s'

source: SECTION segment invalid within DECLARATIVE
nl: SECTION segment ongeldig binnen DECLARATIVE

source: Ignoring CONVERSION
nl: CONVERSION genegeerd

source: ALLOCATE CHARACTERS requires RETURNING clause
nl: ALLOCATE CHARACTERS vereist RETURNING clausule

source: Recursive program call - assuming RECURSIVE attribute
nl: Recursieve programma aanroep - RECURSIVE attribute aangenomen

source: Invalid mnemonic name
nl: Ongeldige mnemonic naam

source: OMITTED only allowed with BY REFERENCE
nl: OMITTED alleen toegestaan met BY REFERENCE

source: Invalid file name reference
nl: Ongeldige bestandsnaam verwijzing

source: BY CONTENT assumed for alphanumeric item
nl: BY CONTENT aangenomen voor alfanumeriek item

source: RETURNING item must have level 01 or 77
nl: RETURNING item moet nivo 01 of 77 zijn

source: RETURNING item is neither in LINKAGE SECTION nor is it BASED
nl: RETURNING item is niet in LINKAGE SECTION en niet BASED

source: Maximum evaluate depth exceeded (%d)
nl: Maximum evaluate diepte overschreden (%d)

source: Invalid THROUGH usage
nl: Ongeldig THROUGH gebruik

source: EXIT PROGRAM is not allowed within a USE GLOBAL procedure
nl: EXIT PROGRAM is niet toegestaan in een USE GLOBAL procedure

source: EXIT PROGRAM only allowed within a PROGRAM type
nl: EXIT PROGRAM is alleen toegestaan in een PROGRAM type

source: EXIT FUNCTION is not allowed within a USE GLOBAL procedure
nl: EXIT FUNCTION is niet toegestaan in een USE GLOBAL procedure

source: EXIT FUNCTION only allowed within a FUNCTION type
nl: EXIT FUNCTION is alleen toegestaan in FUNCTION type

source: EXIT PERFORM is only valid with inline PERFORM
nl: EXIT PERFORM is alleen geldig in een ingesloten PERFORM

source: EXIT SECTION is only valid with an active SECTION
nl: EXIT SECTION is alleen geldig in een SECTION

source: EXIT PARAGRAPH is only valid with an active PARAGRAPH
nl: EXIT PARAGRAPH is alleen geldig in een PARAGRAPH

source: INSPECT missing a keyword
nl: INSPECT mist een sleutelwoord

source: LOCK clause invalid with file LOCK AUTOMATIC
nl: LOCK clausule ongeldig met LOCK AUTOMATIC bestand

source: KEY clause invalid with this file type
nl: KEY clausule ongeldig met dit bestandstype

source: INVALID KEY clause invalid with this file type
nl: INVALID KEY clausule ongeldig met dit bestandstype

source: File sort requires KEY phrase
nl: Bestands sort vereist KEY beschrijving

source: Table sort without keys not implemented yet
nl: Tabel sort zonder keys nog niet geïmplemented

source: File sort requires USING or INPUT PROCEDURE
nl: Bestands sort vereist USING of INPUT PROCEDURE

source: USING invalid with table SORT
nl: USING ongeldig met tabel SORT

source: INPUT PROCEDURE invalid with table SORT
nl: INPUT PROCEDURE ongeldig met tabel SORT

source: INPUT PROCEDURE invalid with MERGE
nl: INPUT PROCEDURE ongeldig met MERGE

source: File sort requires GIVING or OUTPUT PROCEDURE
nl: Bestands sort vereist GIVING of OUTPUT PROCEDURE

source: GIVING invalid with table SORT
nl: GIVING ongeldig met tabel SORT

source: OUTPUT PROCEDURE invalid with table SORT
nl: OUTPUT PROCEDURE ongeldig met tabel SORT

source: SIZE/LENGTH invalid here
nl: SIZE/LENGTH ongeldig hier

source: NOT EQUAL condition disallowed on START statement
nl: NOT EQUAL conditie niet toegestaan bij START statement

source: SUPPRESS statement must be within DECLARATIVES
nl: SUPPRESS statement moet binnen DECLARATIVES

source: UNLOCK invalid for SORT files
nl: UNLOCK ongeldig voor SORT bestanden

source: USE statement must be within DECLARATIVES
nl: USE statement moet binnen DECLARATIVES

source: SECTION header missing before USE statement
nl: SECTION kop ontbreekt voorafgaand aan USE statement

source: USE DEBUGGING not supported in contained program
nl: USE DEBUGGING niet ondersteund in bijgesloten programma

source: Duplicate USE DEBUGGING ON ALL PROCEDURES
nl: Dubbele USE DEBUGGING ON ALL PROCEDURES

source: Invalid target for DEBUGGING ALL
nl: Ongeldig doel voor DEBUGGING ALL

source: LINAGE-COUNTER must be qualified here
nl: LINAGE-COUNTER moet hier gespecificeerd worden

source: Invalid LINAGE-COUNTER usage
nl: Ongeldig LINAGE-COUNTER gebruik

source: '%s' is not a file name
nl: '%s' is geen bestandsnaam

source: LINE-COUNTER must be qualified here
nl: LINE-COUNTER moet hier gespecificeerd worden

source: Invalid LINE-COUNTER usage
nl: Ongeldig LINE-COUNTER gebruik

source: '%s' is not a report name
nl: '%s' is geen report naam

source: PAGE-COUNTER must be qualified here
nl: PAGE-COUNTER moet hier gespecificeerd worden

source: Invalid PAGE-COUNTER usage
nl: Ongeldig PAGE-COUNTER gebruik

source: '%s' not indexed
nl: '%s' niet geïndexeerd

source: '%s' defined here
nl: '%s' hier gedefinieerd

source: Multiple reference to '%s'
nl: Meerdere verwijzingen naar '%s'

source: Invalid mnemonic identifier
nl: Ongeldige mnemonic identifier

source: Integer value expected
nl: Geheel getal waarde

source: Invalid SYMBOLIC integer
nl: Ongeldig SYMBOLIC geheel getal

source: Invalid integer
nl: Ongeldig geheel getal

source: Invalid CLASS value
nl: Ongeldige CLASS waarde

source: Ignoring LEAP-SECOND directive
nl: LEAP-SECOND statement genegeerd

source: Ignoring empty directive
nl: Leeg statement genegeerd

source: Ignoring invalid directive - '%s'
nl: Ongeldig statement genegeerd - '%s'

source: Ignoring invalid directive
nl: Ongeldig statement genegeerd

source: Spurious '$' detected - ignoring
nl: Valse '$' ontdekt - genegeerd

source: PROCESS statement ignored
nl: PROCESS statement genegeerd

source: Dangling IF/ELSE directive
nl: Zwevend IF/ELSE statement

source: Directive nest depth exceeded - %d
nl: Ingesloten richtlijn diepte overschreden - %d

source: ELSE directive without matching IF/ELIF
nl: ELSE statement zonder bijbehorende IF/ELIF

source: END-IF directive without matching IF/ELIF/ELSE
nl: END-IF statement zonder bijbehorende IF/ELIF/ELSE

source: ELIF directive without matching IF/ELIF
nl: ELIF statement zonder bijbehorende IF/ELIF

source: Invalid internal case - %u
nl: Ongeldige interne case - %u

source: Buffer overrun - Literal too long - Aborting
nl: Buffer overloop - Constante te lang - Afbreken

source: Line not terminated by a newline
nl: Regel niet afgesloten met een newline

source: Source text after column %d
nl: Bron tekst na kolom %d

source: Invalid continuation in comment entry
nl: Ongeldige voortzetting in commentaar gebied

source: Invalid indicator '%c' at column 7
nl: Ongeldige indicator '%c' in kolom 7

source: Invalid line continuation
nl: Ongeldige regel voortzetting

source: Continuation character expected
nl: Voortzettings teken verwacht

source: Directive comparison on different types
nl: Statement vergelijking met verschillende types

source: Duplicate define
nl: Dubbele definitie

source: Invalid constant
nl: Ongeldige constante

source: Invalid SOURCEFORMAT directive
nl: Ongeldig SOURCEFORMAT statement

source: Invalid FOLD-COPY-NAME directive
nl: Ongeldig FOLD-COPY-NAME statement

source: Invalid SOURCE directive
nl: Ongeldig SOURCE statement

source: Invalid DEFINE/SET directive
nl: Ongeldig DEFINE/SET statement

source: TURN directive not yet implemented
nl: TURN statement nog niet geïmplementeerd

source: Invalid IF/ELIF directive
nl: Ongeldig IF/ELIF statement

source: Device name
nl: Apparaat naam

source: Switch name
nl: Switch naam

source: Feature name
nl: Kenmerk naam

source: Unknown
nl: Onbekend

source: '%s' reserved word, but not supported
nl: '%s' gereserveerd woord, maar niet ondersteund

source: Reserved Words Implemented (Y/N)
nl: Gereserveerde woorden Geïmplementeerd (J/N)

source: N (85 obsolete)
nl: N (85 niet meer in gebruik)

source: Y (Context sensitive)
nl: Y (Context gevoelig)

source: N (Context sensitive)
nl: N (Context gevoelig)

source: Extra (obsolete) context sensitive words
nl: Extra (niet meer in gebruik) context gevoelige woorden

source: Extra internal registers Definition
nl: Extra interne registers Definitie

source: Intrinsic Function Implemented Parameters
nl: Intrinsieke Functie Geïmplementeerd Parameters

source: Mnemonic names
nl: Mnemonic namen

source: Extended mnemonic names (with -fsyntax-extension)
nl: Uitgebreide mnemonic namen (met -fsyntax-extension)

source: Word length exceeds 31 characters - '%s'
nl: Woord lengte overschrijdt 31 karakters - '%s'

source: Word length exceeds maximum allowed - '%s'
nl: Woord lengte overschrijdt maximum toegestaan - '%s'

source: A constant may not be used here - '%s'
nl: Hier mag geen constante worden gebruikt - '%s'

source: Invalid symbol: %s - Skipping word
nl: Ongeldig symbool: %s - Woord overgeslagen

source: Alphanumeric literal has zero length
nl: Alfanumerieke constante heeft lengte nul

source: A SPACE will be assumed
nl: Een SPATIE wordt aangenomen

source: Invalid X literal: %s
nl: Ongeldige X constante: %s

source: Invalid H literal: %s
nl: Ongeldige H constante: %s

source: Invalid numeric literal
nl: Ongeldige numerieke constante

source: Invalid floating-point literal
nl: Ongeldige drijvende komma constante

source: Invalid CONSTANT - %s
nl: Ongeldige CONSTANT - %s

source: Invalid alphanumeric CONSTANT - %s
nl: Ongeldige alfanumerieke CONSTANT - %s

source: Empty alphanumeric CONSTANT - %s
nl: Lege alfanumerieke CONSTANT - %s

source: Invalid numeric CONSTANT - %s
nl: Ongeldige numerieke CONSTANT - %s

source: %s clause is required for file '%s'
nl: %s clausule is verplicht voor bestand '%s'

source: Internal error node
nl: Interne fout knooppunt

source: Unknown constant
nl: Onbekende constante

source: <Unexpected tree tag %d>
nl: <Onverwacht boom label %d>

source: FUNCTION %s has invalid/not supported arguments - Tag %d
nl: FUNCTION %s heeft ongeldige/niet ondersteunde argumenten - Label %d

source: Unexpected cast type -> %d
nl: Onverwacht wijziging type -> %d

source: Unknown tree tag %d Category %d
nl: Onbekende boom label %d Categorie %d

source: Unexpected numeric usage -> %d
nl: Onverwacht numeriek gebruik -> %d

source: Unexpected category -> %d
nl: Onverwachte categorie -> %d

source: Invalid literal cast - Aborting
nl: Ongeldige constante wijziging - Afbreken

source: Numeric literal exceeds limit - Aborting
nl: Numerieke constante overschrijdt limiet - Afbreken

source: Invalid LOCALE literal
nl: Ongeldige LOCALE constante

source: Numeric field cannot be larger than %d digits
nl: Numeriek veld mag niet groter zijn dan %d cijfers

source: Invalid picture string - '%s'
nl: Ongeldige opmaak string - '%s'

source: ALTERNATE clause invalid for this file type
nl: ALTERNATE clausule ongeldig voor dit bestandstype

source: RECORD clause invalid for this file type
nl: RECORD clausule ongeldig voor dit bestandstype

source: ORGANIZATION clause invalid
nl: ORGANIZATION clausule ongeldig

source: Invalid KEY item '%s'
nl: Ongeldig KEY item '%s'

source: Record size too small '%s'
nl: Record te klein '%s'

source: Record size too large '%s' (%d)
nl: Record te groot '%s' (%d)

source: Record size exceeds maximum allowed (%d) - File '%s'
nl: Record grootte overschrijdt maximum toegestaan (%d) - Bestand '%s'

source: Invalid expression
nl: Ongeldige expressie

source: Unexpected operator -> %d
nl: Onverwachte operator -> %d

source: FUNCTION '%s' has invalid reference modification
nl: FUNCTION '%s' heeft ongeldige verwijzingsmodificatie

source: FUNCTION '%s' unknown
nl: FUNCTION '%s' onbekend

source: FUNCTION '%s' not implemented
nl: FUNCTION '%s' niet geïmplementeerd

source: FUNCTION '%s' has wrong number of arguments
nl: FUNCTION '%s' aantal argumenten incorrect

source: FUNCTION '%s' can not have reference modification
nl: FUNCTION '%s' kan geen verwijzingsmodificatie hebben

source: FUNCTION '%s' has invalid parameter
nl: FUNCTION '%s' heeft een ongeldige parameter

source: FUNCTION '%s' has invalid first parameter
nl: FUNCTION '%s' heeft een ongeldige eerste parameter

source: Invalid use of 88 level item
nl: Ongeldige gebruik van 88 nivo item

source: '%s' is not group name
nl: '%s' is geen groep naam

source: '%s' is not a numeric name
nl: '%s' is geen numerieke naam

source: '%s' is not numeric or numeric-edited name
nl: '%s' is niet numeriek of numeriek-opmaak naam

source: '%s' is not a numeric value
nl: '%s' is geen numerieke waarde

source: '%s' is not an integer value
nl: '%s' is geen heel getal

source: A positive numeric integer is required here
nl: Een positief numeriek heel getal is hier verplicht

source: System routine Parameters
nl: Systeem routine Parameters

source: ON/OFF usage requires a SWITCH name
nl: ON/OFF gebruik vereist een SWITCH naam

source: ASSIGN interpreted as %s
nl: ASSIGN geïnterpreteerd als %s

source: Subscripts missing for '%s' - Defaulting to 1
nl: Index ontbreekt voor '%s' - Standaard 1

source: '%s' cannot be reference modified
nl: '%s' accepteert geen verwijzingsmodificatie

source: '%s' cannot be subscripted
nl: '%s' accepteert geen index

source: '%s' requires 1 subscript
nl: '%s' vereist 1 index

source: '%s' requires %d subscripts
nl: '%s' vereist %d indices

source: '%s' has no OCCURS clause
nl: '%s' heeft geen OCCURS clausule

source: Subscript of '%s' out of bounds: %d
nl: Index van '%s' buiten grens: %d

source: Offset of '%s' out of bounds: %d
nl: Start positie van '%s' buiten grens: %d

source: Length of '%s' out of bounds: %d
nl: Lengte van '%s' buiten grens: %d

source: Reference modification not allowed here
nl: Verwijzingsmodificatie hier niet toegestaan

source: ANY LENGTH item not allowed here
nl: ANY LENGTH item hier niet toegestaan

source: 88 level item not allowed here
nl: 88 nivo item hier niet toegestaan

source: Variable length item not allowed here
nl: Variabele lengte hier niet toegestaan here

source: '%s' is not an alphabet name
nl: '%s' is geen alfabet naam

source: Duplicate character values in alphabet '%s'
nl: Dubbele karakter waarde in alfabet '%s'

source: Invalid character values in alphabet '%s'
nl: Ongeldige karakter waarde in alfabet '%s'

source: Invalid ALPHABET name
nl: Ongeldige ALPHABET naam

source: Duplicate values in class '%s'
nl: Dubbele waarden in class '%s'

source: '%s' is not a locale name
nl: '%s' is niet een LOCALE naam

source: '%s' will be implicitly defined
nl: '%s' wordt impliciet gedefinieerd

source: ASSIGN data item '%s' invalid
nl: ASSIGN data item '%s' ongeldig

source: '%s' CURSOR is not 4 or 6 characters long
nl: '%s' CURSOR is niet 4 of 6 karakters lang

source: '%s' CRT STATUS is not 4 characters long
nl: '%s' CRT STATUS is niet 4 karakters lang

source: '%s' ODO field item invalid here
nl: '%s' ODO veld item is hier ongeldig

source: '%s' cannot have OCCURS DEPENDING
nl: '%s' kan geen OCCURS DEPENDING hebben

source: '%s' ODO item must have GLOBAL attribute
nl: '%s' ODO item moet GLOBAL attribute hebben

source: RECORD DEPENDING item must be in WORKING/LOCAL/LINKAGE section
nl: RECORD DEPENDING item moet in WORKING/LOCAL/LINKAGE sectie

source: Invalid RECORD DEPENDING item
nl: Ongeldig RECORD DEPENDING item

source: '%s' is not in DECLARATIVES
nl: '%s' is niet in DECLARATIVES

source: Invalid reference to '%s' (In DECLARATIVES)
nl: Ongeldige verwijzing naar '%s' (In DECLARATIVES)

source: '%s' not a procedure name
nl: '%s' geen procedure naam

source: '%s' - DEBUGGING target invalid with ALL PROCEDURES
nl: '%s' - DEBUGGING doel ongeldig met ALL PROCEDURES

source: '%s' - DEBUGGING target invalid
nl: '%s' - DEBUGGING doel ongeldig

source: '%s' is not a valid DEBUGGING target
nl: '%s' is geen geldig DEBUGGING doel

source: '%s' is not an alterable paragraph
nl: '%s' is te wijzigen paragraaf

source: Suggest parentheses around AND within OR
nl: Suggestie haken om AND binnen OR

source: Internal decimal structure size exceeded - %d
nl: Interne decimal structuur grootte overschrijdt - %d

source: Unexpected operation %d
nl: Onverwachte operatie %d

source: Unexpected constant expansion
nl: Onverwachte constante expansie

source: No CORRESPONDING items found
nl: Geen CORRESPONDING items gevonden

source: Invalid PROMPT literal
nl: Ongeldige PROMPT constante

source: Invalid PROMPT identifier
nl: Ongeldige PROMPT identifier

source: Invalid input device '%s'
nl: Ongeldige invoer apparaat '%s'

source: '%s' is not defined in SPECIAL-NAMES
nl: '%s' is niet definieerd in SPECIAL-NAMES

source: Target of ALLOCATE is not a BASED item
nl: Doel van ALLOCATE is geen BASED item

source: Target of RETURNING is not a data pointer
nl: Doel van RETURNING is geen data pointer

source: The CHARACTERS field of ALLOCATE must be numeric
nl: Het CHARACTERS veld van ALLOCATE moet numeriek zijn

source: INITIALIZED TO item is not alphanumeric
nl: INITIALIZED TO item is niet alfanumeriek

source: Only alphanumeric FUNCTION types are allowed here
nl: Alleen alphanumerieke FUNCTION types zijn hier toegestaan

source: Invalid RETURNING field
nl: Ongeldig RETURNING veld

source: STDCALL not available on this platform
nl: STDCALL niet beschikbaar op dit platform

source: STDCALL used on 64-bit Windows platform
nl: STDCALL gebruikt op 64-bit Windows platform

source: STATIC CALL convention requires a literal program name
nl: STATIC CALL conventie vereist een constante als programma naam

source: Numeric literal is negative
nl: Numerieke constante is negatief

source: Figurative constant invalid here
nl: Figuratieve constante ongeldig hier

source: '%s' is not a valid data name
nl: '%s' is geen geldige data naam

source: '%s' ANY LENGTH item not passed BY REFERENCE
nl: '%s' ANY LENGTH item niet doorgegeven BY REFERENCE

source: '%s' is not a 01 or 77 level item
nl: '%s' is geen 01 of 77 nivo item

source: Wrong number of CALL parameters for '%s'
nl: Verkeerd aantal CALL parameters voor '%s'

source: '%s' is an invalid type for DISPLAY operand
nl: '%s' is een ongeldig type voor DISPLAY operand

source: Invalid type for DISPLAY operand
nl: Ongeldig type voor DISPLAY operand

source: Invalid output device
nl: Ongeldig uitvoer apparaat

source: '%s' is not an output device
nl: '%s' is geen uitvoer apparaat

source: Invalid use of 88 level in WHEN expression
nl: Ongeldig gebruik van 88 nivo in WHEN expressie

source: Wrong number of WHEN parameters
nl: Verkeerd aantal WHEN parameters

source: Target %d of FREE is not a BASED data item
nl: Doel %d van FREE is geen BASED data item

source: Target %d of FREE must be a data pointer
nl: Doel %d van FREE moet een data pointer zijn

source: GO TO with multiple procedure-names
nl: GO TO met meerdere procedure-namen

source: Data name expected before CHARACTERS
nl: Data naam verwacht voorafgaand aan CHARACTERS

source: Data name expected before ALL
nl: Data naam verwacht voor ALL

source: Data name expected before LEADING
nl: Data naam verwacht voor LEADING

source: Data name expected before TRAILING
nl: Data naam verwacht voor TRAILING

source: ALL, LEADING or TRAILING expected before '%s'
nl: ALL, LEADING of TRAILING verwacht voor '%s'

source: Operand has wrong size
nl: Operand heeft verkeerde grootte

source: Internal register '%s' defined as BINARY-LONG
nl: Intern register '%s' gedefinieerd als BINARY-LONG

source: '%s' defined here as USAGE %s
nl: '%s' hier gedefinieerd als USAGE %s

source: '%s' defined here as USAGE FLOAT
nl: '%s' hier gedefinieerd als USAGE FLOAT

source: '%s' defined here as USAGE DOUBLE
nl: '%s' hier gedefinieerd als USAGE DOUBLE

source: '%s' defined here as USAGE FLOAT EXTENDED
nl: '%s' hier gedefinieerd als USAGE FLOAT EXTENDED

source: '%s' defined here as USAGE FLOAT-BINARY-7
nl: '%s' hier gedefinieerd als USAGE FLOAT-BINARY-7

source: '%s' defined here as USAGE FLOAT-BINARY-16
nl: '%s' hier gedefinieerd als USAGE FLOAT-BINARY-16

source: '%s' defined here as USAGE FLOAT-BINARY-34
nl: '%s' hier gedefinieerd als USAGE FLOAT-BINARY-34

source: '%s' defined here as USAGE FLOAT-DECIMAL-16
nl: '%s' hier gedefinieerd als USAGE FLOAT-DECIMAL-16

source: '%s' defined here as USAGE FLOAT-DECIMAL-34
nl: '%s' hier gedefinieerd als USAGE FLOAT-DECIMAL-34

source: '%s' defined here as PIC %s
nl: '%s' hier gedefinieerd als PIC %s

source: '%s' defined here as a group of length %d
nl: '%s' hier gedefinieerd als een groep met lengte %d

source: Overlapping MOVE may produce unpredictable results
nl: Overlappende MOVE kan onvoorspelbare resultaten geven

source: Invalid destination for MOVE
nl: Ongeldige bestemming voor MOVE

source: Source is non-numeric - substituting zero
nl: Bron is niet-numeriek - vervangen door nul

source: Numeric move to ALPHABETIC
nl: Numerieke move naar ALPHABETIC

source: Data item not signed
nl: Data item kent geen teken

source: Ignoring sign
nl: Teken genegeerd

source: Invalid source for MOVE
nl: Ongeldige bron voor MOVE

source: Invalid VALUE clause
nl: Ongeldige VALUE clausule

source: Invalid MOVE statement
nl: Ongeldig MOVE statement

source: Invalid VALUE clause - literal exceeds data size
nl: Ongeldige VALUE clausule - constante overschrijdt data grootte

source: Numeric literal exceeds data size
nl: Numerieke constante overschrijdt data grootte

source: Move non-integer to alphanumeric
nl: Move geen heel getal naar alfanumeriek

source: Numeric value is expected
nl: Numerieke waarde verwacht

source: Alphanumeric value is expected
nl: Alanumerieke waarde verwacht

source: Value does not fit the picture string
nl: Waarde past niet in de opmaak string

source: Value size exceeds data size
nl: Grootte van de waarde overschrijdt de data grootte

source: Sending field larger than receiving field
nl: Zendende veld groter dan ontvangende veld

source: Some digits may be truncated
nl: Some cijfers worden mogelijk afgekapt

source: Invalid MOVE target - %s
nl: Ongeldig MOVE doel - %s

source: READ PREVIOUS not allowed for this file type
nl: READ PREVIOUS niet toegestaan bij dit bestands type

source: KEY ignored with sequential READ
nl: KEY genegeerd bij sequentiële READ

source: RELEASE not allowed on this record item
nl: RELEASE niet toegestaan bij this record item

source: Invalid SEARCH ALL condition
nl: Ongeldige SEARCH ALL conditie
