Repository: ayumin/open-cobol
Catalog: po/*.po
Languages: fr

source: Overlapping MOVE may produce unpredictable results
fr: MOVE sur objets se chevauchant peut produire des résultats imprévisibles

source: Invalid destination for MOVE
fr: Destination invalide dans l'instruction MOVE

source: Source is non-numeric - substituting zero
fr: La source n'est pas numérique - substitution par zéro

source: Numeric move to ALPHABETIC
fr: Conversion numérique en ALPHABETIQUE

source: Data item not signed
fr: Objet de donnée non signé

source: Ignoring sign
fr: Signe ignoré

source: Invalid source for MOVE
fr: Source invalide pour instruction MOVE

source: Invalid VALUE clause
fr: Clause VALUE invalide

source: Invalid MOVE statement
fr: Instruction MOVE invalide

source: Invalid VALUE clause - literal exceeds data size
fr: Clause VALUE invalide - La valeur littérale dépasse la taille de la variable de donnée

source: Numeric literal exceeds data size
fr: Le littéral numérique dépasse la taille de la variable de donnée

source: Move non-integer to alphanumeric
fr: Convertit valeur non entière en alphanumérique

source: Numeric value is expected
fr: Une valeur numérique est attendue

source: Alphanumeric value is expected
fr: Une valeur alphanumérique est attendue

source: Value does not fit the picture string
fr: La valeur ne répond pas à la chaîne picture

source: Value size exceeds data size
fr: La taille de la valeur excède la taille de la donnée

source: Sending field larger than receiving field
fr: Champ en émission plus grand que celui en réception

source: Some digits may be truncated
fr: Des chiffres peuvent être tronqués

source: Invalid MOVE target - %s
fr: Cible MOVE invalide - %s

source: READ PREVIOUS not allowed for this file type
fr: READ PREVIOUS non autorisé pour ce type de fichier

source: KEY ignored with sequential READ
fr: KEY ignorée avec une instruction READ sur fichier séquentiel

source: RELEASE not allowed on this record item
fr: RELEASE non autorisé sur cet objet enregistrement

source: Invalid SEARCH ALL condition
fr: Condition SEARCH ALL invalide

source: The targets of SET must be either indexes or pointers
fr: Les cibles de SET doivent être soit des indexes, soit des pointeurs

source: SET targets must be PROGRAM-POINTER
fr: Les cibles SET doivent être des PROGRAM-POINTER

source: The address of '%s' cannot be changed
fr: L'adresse de '%s' ne peut être modifiée

source: SET target is invalid - '%s'
fr: La cible SET est invalide - '%s'

source: Invalid SET statement
fr: instruction SET invalide

source: Field does not have FALSE clause
fr: Champ n'a pas de clause FALSE

source: SET ATTRIBUTE requires a screen item as subject
fr: SET ATTRIBUTE nécessite un objet écran (screen) comme sujet

source: SET ATTRIBUTE subject does not refer to a screen item
fr: Sujet SET ATTRIBUTE ne se réfère pas à un objet écran (screen)

source: Invalid SORT filename
fr: Nom de fichier SORT invalide

source: Invalid SORT USING parameter
fr: paramètre SORT USING invalide

source: Invalid SORT GIVING parameter
fr: paramètre SORT GIVING invalide

source: Invalid key item
fr: Objet clé invalide

source: LENGTH/SIZE clause only allowed on INDEXED files
fr: Clause LENGTH/SIZE seulement autorisée pour des fichiers indexés (INDEXED)

source: START not allowed with ACCESS MODE RANDOM
fr: START non autorisé en mode d'accès aléatoire (ACCESS MODE RANDOM)

source: LOCK clause invalid here
fr: Clause LOCK invalide ici

source: Warn if obsolete features are used
fr: Averti si des caractéristiques obsolètes sont utilisées

source: Warn if archaic features are used
fr: Averti si des caractéristiques archaïques sont utilisées

source: Warn incompatible redefinition of data items
fr: Averti sur redéfinition incompatible d'objets de données

source: Warn inconsistent constant
fr: Averti sur constante incohérente

source: Warn overlapping MOVE items
fr: Averti sur MOVE sur objets se chevauchant

source: Warn lack of parentheses around AND within OR
fr: Averti sur manque de parenthèses autour d'expressions AND au milieu/à l'intérieur d'expressions OR

source: Warn type mismatch strictly
fr: Averti sur non correspondance strict de type

source: Warn implicitly defined data items
fr: Averti sur objets de données définis implicitement

source: Warn CORRESPONDING with no matching items
fr: Averti sur CORRESPONDING sans article correspondant

source: Warn EXTERNAL item with VALUE clause
fr: Averti sur objet EXTERNAL comprenant une clause VALUE

source: Warn non 01/77 items for CALL params
fr: Averti sur objets de niveau autre que 01/77 pour les paramètres d'un CALL

source: Warn text after column 72, FIXED format
fr: Averti sur texte après colonne 72 en mode format fixe (FIXED)

source: Warn lack of scope terminator END-XXX
fr: Averti sur manque de scope du terminateur END-XXX

source: Warn possible field truncation
fr: Averti sur possible troncature de champ

source: Warn dangling LINKAGE items
fr: Averti sur objets en LINKAGE SECTION inutilisés

source: Warn unreachable statements
fr: Averti sur instructions inaccessibles

source: LoadLibrary/GetProcAddress error %d
fr: Erreur LoadLibrary/GetProcAddress %d

source: Cannot find module
fr: Impossible de trouver le module

source: Cannot find entry point
fr: Impossible de trouver le point d'entrée

source: Indeterminable error
fr: Erreur indéterminable

source: NULL parameter passed to '%s'
fr: paramètre NULL passé à '%s'

source: Invalid number of arguments to '%s'
fr: nombre d'arguments invalide pour '%s'

source: Multiple call to 'cob_setjmp'
fr: Appels multiples à 'cob_setjmp'

source: Call to 'cob_longjmp' with no prior 'cob_setjmp'
fr: Appel à 'cob_longjmp' sans appel préalable à 'cob_setjmp'

source: %s: option `%s' is ambiguous
fr: %s: option `%s' est ambigüe

source: %s: option `--%s' doesn't allow an argument
fr: %s: option `--%s' n'autorise pas d'arguments

source: %s: option `%c%s' doesn't allow an argument
fr: %s: option `%c%s' n'autorise pas d'arguments

source: %s: option `%s' requires an argument
fr: %s: option `%s' nécessite un argument

source: %s: unrecognized option `--%s'
fr: %s: option non reconnue `--%s'

source: %s: unrecognized option `%c%s'
fr: %s: option non reconnue `%c%s'

source: %s: invalid option -- %c
fr: %s: option invalide -- %c

source: %s: option requires an argument -- %c
fr: %s: option nécessite un argument -- %c

source: %s: option `-W %s' is ambiguous
fr: %s: option `-W %s' est ambigüe

source: %s: option `-W %s' doesn't allow an argument
fr: %s: option `-W %s' n'autorise pas d'arguments

source: Abnormal termination - File contents may be incorrect
fr: Terminaison anormale - Le contenu du fichier peut être incorrect

source: Malloc error
fr: Erreur sur malloc

source: cob_init() has not been called
fr: cob_init() n'a pas été appelé

source: Attempt to CANCEL active program
fr: Tente d'annuler (CANCEL) le programme actif

source: Codegen error - Please report this
fr: Erreur de génération de code - Merci de rapporter ceci

source: Recursive call of chained program
fr: Appel récursif de programme chaîné

source: Stack overflow, possible PERFORM depth exceeded
fr: Débordement de pile, possible dépassement de profondeur sur PERFORM

source: Invalid entry/exit in GLOBAL USE procedure
fr: Point d'entrée (entry)/sortie invalide dans la procédure USE GLOBAL

source: Unable to allocate memory
fr: Impossible d'allouer de la mémoire

source: Invalid entry into module
fr: Point d'entrée invalide dans le module

source: Invalid recursive COBOL CALL
fr: CALL COBOL récursif invalide

source: End of file
fr: Fin de fichier

source: Key out of range
fr: La clé est hors des valeurs limites

source: Key order not ascending
fr: La clé n'est pas ordonnée de manière ascendante

source: Record key already exists
fr: La clé de l'enregistrement existe déjà

source: Record key does not exist
fr: La clé de l'enregistrement n'existe pas

source: Permanent file error
fr: Erreur de fichier permanente

source: File does not exist
fr: Le fichier n'existe pas

source: Permission denied
fr: La permission est refusée

source: File already open
fr: Le fichier est déjà ouvert

source: File not open
fr: Le fichier n'est pas ouvert

source: READ must be executed first
fr: READ doit être executé en premier

source: Record overflow
fr: Débordement d'enregistrement

source: READ/START not allowed
fr: READ/START non autorisé

source: WRITE not allowed
fr: WRITE non autorisé

source: DELETE/REWRITE not allowed
fr: DELETE/REWRITE non autorisé

source: Record locked by another file connector
fr: Enregistrement bloqué par un autre connecteur fichier

source: LINAGE values invalid
fr: Valeurs LINAGE invalides

source: File sharing conflict
fr: Conflit sur partage de fichier

source: Runtime library is not configured for this operation
fr: La bibliothèque d'exécution (runtime) n'est pas configurée pour cette opération

source: Unknown file error
fr: Erreur de fichier inconnue

source: %s (Status = %02d) File : '%s'
fr: %s (Statut = %02d) Fichier : '%s'

source: Attempt to use non-implemented function
fr: Tentative d'utilisation d'une fonction non implémentée

source: Unknown failure : %d
fr: Motif d'échec inconnu : %d

source: Error - Version mismatch
fr: Erreur - Version non correspondante

source: %s has version/patch level %s/%d
fr: %s de version/niveau de patch %s/%d

source: Library has version/patch level %s/%d
fr: Bibliothèque de version/niveau de patch %s/%d

source: CALL to %s requires %d parameters
fr: CALL à %s nécessite %d paramètres

source: BASED/LINKAGE item '%s' has NULL address
fr: L'objet BASED/LINKAGE '%s' a une addresse NULL

source: '%s' not numeric: '%s'
fr: '%s' non numérique : '%s'

source: OCCURS DEPENDING ON '%s' out of bounds: %d
fr: OCCURS DEPENDING ON '%s' hors des limites : %d

source: EXTERNAL item '%s' previously allocated with size %d, requested size is %d
fr: Objet EXTERNAL '%s' précédemment alloué pour une taille de %d, la taille demandée est %d

source: 'cobcommandline' - Runtime has not been initialized
fr: 'cobcommandline' - Le système d'exécution (Runtime) n'a pas été initialisé

source: Parameter to SYSTEM call is larger than 8192 characters
fr: Le paramètre passé à (la fonction OC) SYSTEM est plus grand que 8192 caractères

source: Memory allocation failure
fr: Echec d'allocation mémoire

source: BDB error: %s
fr: Erreur BDB : %s

source: BDB error: %s %s
fr: Erreur BDB : %s %s

source: Cannot join BDB environment, error: %d %s
fr: Impossible de joindre l'environnement BDB, erreur : %d %s

source: Cannot join BDB environment, env_open: %d %s
fr: Impossible de joindre l'environnement BDB, env_open : %d %s

source: 'CBL_CHECK_FILE_EXIST' - File detail area is too short
fr: 'CBL_CHECK_FILE_EXIST' - La zone de détails du fichier est trop courte

source: 'C$FILEINFO' - File detail area is too short
fr: 'C$FILEINFO' - La zone de détails du fichier est trop courte

source: SORT is unable to acquire temporary file
fr: SORT est incapable d'obtenir un fichier temporaire

source: WARNING - Implicit CLOSE of %s ('%s')
fr: AVERTISSEMENT - CLOSE implicite de %s ('%s')

source: Failed to initialize curses
fr: Echec d'initialisation de la bibliothèque "curses"

source: (Not representable)
fr: (Impossible à représenter)

source: Usage: cobcrun PROGRAM [param ...]
fr: Syntaxe : cobcrun PROGRAM [param ...]

source: or : cobcrun options
fr: ou : cobcrun options

source: PROGRAM name exceeds 31 characters
fr: nom de PROGRAM dépasse 31 caractères
