Repository: ayumin/open-cobol
Catalog: po/*.po
Languages: fr

source: File cannot have both EXTERNAL and GLOBAL clauses
fr: Un fichier ne peut avoir en même temps les clauses EXTERNAL et GLOBAL

source: RECORD clause ignored for LINE SEQUENTIAL
fr: Clause RECORD ignorée pour fichier de type LINE SEQUENTIAL

source: RECORD clause invalid
fr: Clause RECORD invalide

source: RECORD size exceeds maximum allowed (%d)
fr: La taille RECORD excède le maximum autorisé (%d)

source: LINAGE clause with wrong file type
fr: Clause LINAGE avec un mauvais type de fichier

source: CODE-SET clause invalid for file type
fr: Clause CODE-SET invalide pour un type fichier

source: Alphabet-name is expected '%s'
fr: Un nom d'alphabet est attendu '%s'

source: Ignoring CODE-SET '%s'
fr: Ignore CODE-SET '%s'

source: REPORT clause with wrong file type
fr: Clause REPORT avec le mauvais type de fichier

source: Item requires a data name
fr: Objet nécessite un nom de variable de donnée

source: CONSTANT item not at 01 level
fr: Objet CONSTANT pas de niveau 01

source: REDEFINES clause should follow entry-name
fr: La clause REDEFINES devrait se trouver après un nom d'entrée/champ

source: REDEFINES clause must follow entry-name
fr: La clause REDEFINES doit se trouver après un nom d'entrée/champ

source: %s not allowed here
fr: %s non autorisé ici

source: %s only allowed at 01/77 level
fr: %s seulement autorisé pour des objets de niveau 01/77

source: %s and %s are mutually exclusive
fr: %s et %s sont mutuellement exclusif

source: Maximum OCCURS depth exceeded (%d)
fr: Profondeur maximum pour OCCURS dépassée (%d)

source: FALSE clause only allowed for 88 level
fr: Clause FALSE seulement autorisée pour des objets de niveau 88

source: RENAMES may not reference a level 01 or > 50
fr: RENAMES ne peut faire référence à des objets de niveau 01 ou > 50

source: GLOBAL is not allowed with RD
fr: GLOBAL n'est pas autorisé avec RD

source: Invalid PAGE clause
fr: Clause PAGE invalide

source: INITIAL specified on non-input field
fr: INITIAL spécifié sur champ non typé entrée (non-input)

source: GLOBAL is not allowed with screen items
fr: GLOBAL n'est pas autorisé avec des objets écran

source: Executable program requested but PROCEDURE/ENTRY has USING clause
fr: Programme exécutable demandé sauf que PROCEDURE/ENTRY comporte une clause USING

source: Number of parameters exceeds maximum %d
fr: Nombre de paramètres dépasse le maximum %d

source: CHAINING invalid in user FUNCTION
fr: CHAINING est invalide dans une FUNCTION définie par l'utilisateur

source: SIZE only allowed for BY VALUE items
fr: SIZE seulement autorisé pour des objets passés BY VALUE

source: Invalid value for SIZE
fr: Valeur invalide pour SIZE

source: OPTIONAL only allowed for BY REFERENCE items
fr: OPTIONAL seulement autorisé pour des objets passés BY REFERENCE

source: RETURNING clause is required for a FUNCTION
fr: Clause RETURNING est obligatoire dans la déclaration d'une FUNCTION

source: RETURNING item must have level 01
fr: Objet RETURNING doit être de niveau 01

source: Unknown statement '%s'
fr: Instruction inconnue '%s'

source: SECTION segment invalid within DECLARATIVE
fr: Segment SECTION invalide à l'intérieur de DECLARATIVE

source: Ignoring CONVERSION
fr: Ignore CONVERSION

source: ALLOCATE CHARACTERS requires RETURNING clause
fr: ALLOCATE CHARACTERS nécessite la clause RETURNING

source: Recursive program call - assuming RECURSIVE attribute
fr: Appel de programme récursif - considère l'attribut RECURSIVE présent

source: Invalid mnemonic name
fr: Nom mnémonique invalide

source: OMITTED only allowed with BY REFERENCE
fr: OMITTED seulement autorisé avec BY REFERENCE

source: Invalid file name reference
fr: Référence de nom de fichier invalide

source: BY CONTENT assumed for alphanumeric item
fr: BY CONTENT supposé pour objet alphanumérique

source: RETURNING item must have level 01 or 77
fr: Objet RETURNING doit être de niveau 01 ou 77

source: RETURNING item is neither in LINKAGE SECTION nor is it BASED
fr: Objet RETURNING n'est ni dans une LINKAGE SECTION, ni une variable BASED

source: Maximum evaluate depth exceeded (%d)
fr: Profondeur maximum pour evaluate dépassée (%d)

source: Invalid THROUGH usage
fr: Utilisation de THROUGH invalide

source: EXIT PROGRAM is not allowed within a USE GLOBAL procedure
fr: EXIT PROGRAM n'est pas autorisé dans une procédure USE GLOBAL

source: EXIT PROGRAM only allowed within a PROGRAM type
fr: EXIT PROGRAM seulement autorisé à l'intérieur d'un type PROGRAM

source: EXIT FUNCTION is not allowed within a USE GLOBAL procedure
fr: EXIT FUNCTION n'est pas autorisé à l'intérieur d'une procédure USE GLOBAL

source: EXIT FUNCTION only allowed within a FUNCTION type
fr: EXIT FUNCTION seulement autorisé dans une FUNCTION

source: EXIT PERFORM is only valid with inline PERFORM
fr: EXIT PERFORM n'est seulement valable qu'avec le PERFORM correspondant

source: EXIT SECTION is only valid with an active SECTION
fr: EXIT SECTION n'est seulement valable qu'avec une SECTION active

source: EXIT PARAGRAPH is only valid with an active PARAGRAPH
fr: EXIT PARAGRAPH n'est seulement valable qu'avec un PARAGRAPH actif

source: INSPECT missing a keyword
fr: Mot-clé manquant dans INSPECT

source: LOCK clause invalid with file LOCK AUTOMATIC
fr: Clause LOCK invalide pour un fichier avec l'attribut LOCK AUTOMATIC

source: KEY clause invalid with this file type
fr: Clause KEY invalide avec ce type de fichier

source: INVALID KEY clause invalid with this file type
fr: Clause INVALID KEY invalide avec ce type de fichier

source: File sort requires KEY phrase
fr: SORT sur fichier nécessite la phrase KEY

source: Table sort without keys not implemented yet
fr: SORT sur table sans clés n'est pas encore implémenté

source: File sort requires USING or INPUT PROCEDURE
fr: SORT sur fichier nécessite USING ou INPUT PROCEDURE

source: USING invalid with table SORT
fr: USING invalide avec SORT sur table

source: INPUT PROCEDURE invalid with table SORT
fr: INPUT PROCEDURE invalide avec SORT sur table

source: INPUT PROCEDURE invalid with MERGE
fr: INPUT PROCEDURE invalide avec MERGE

source: File sort requires GIVING or OUTPUT PROCEDURE
fr: SORT sur fichier nécessite GIVING ou OUTPUT PROCEDURE

source: GIVING invalid with table SORT
fr: GIVING invalide avec SORT sur table

source: OUTPUT PROCEDURE invalid with table SORT
fr: OUTPUT PROCEDURE invalide avec SORT sur table

source: SIZE/LENGTH invalid here
fr: SIZE/LENGTH invalide ici

source: NOT EQUAL condition disallowed on START statement
fr: Condition NOT EQUAL non autorisée sur instruction START

source: SUPPRESS statement must be within DECLARATIVES
fr: Instruction SUPPRESS doit être déclarée à l'intérieur de DECLARATIVES

source: UNLOCK invalid for SORT files
fr: UNLOCK invalide pour SORT sur fichier

source: USE statement must be within DECLARATIVES
fr: Instruction USE doit être déclarée à l'intérieur de DECLARATIVES

source: SECTION header missing before USE statement
fr: Entête SECTION manquant avant instruction USE

source: USE DEBUGGING not supported in contained program
fr: USE DEBUGGING non supporté dans des sous-programmes (contained program)

source: Duplicate USE DEBUGGING ON ALL PROCEDURES
fr: Doublon de USE DEBUGGING ON ALL PROCEDURES

source: Invalid target for DEBUGGING ALL
fr: Cible invalide pour DEBUGGING ALL

source: LINAGE-COUNTER must be qualified here
fr: LINAGE-COUNTER doit être qualifié ici

source: Invalid LINAGE-COUNTER usage
fr: Utilisation de LINAGE-COUNTER invalide

source: '%s' is not a file name
fr: '%s' n'est pas un nom de fichier

source: LINE-COUNTER must be qualified here
fr: LINE-COUNTER doit être qualifié ici

source: Invalid LINE-COUNTER usage
fr: Utilisation de LINE-COUNTER invalide

source: '%s' is not a report name
fr: '%s' n'est pas un nom de rapport

source: PAGE-COUNTER must be qualified here
fr: PAGE-COUNTER doit être qualifié ici

source: Invalid PAGE-COUNTER usage
fr: Utilisation de PAGE-COUNTER invalide

source: '%s' not indexed
fr: '%s' non indexé

source: '%s' defined here
fr: '%s' défini ici

source: Multiple reference to '%s'
fr: Références multiples à '%s'

source: Invalid mnemonic identifier
fr: Identificateur mnémonique invalide

source: Integer value expected
fr: Valeur entière attendue

source: Invalid SYMBOLIC integer
fr: Entier SYMBOLIC invalide

source: Invalid integer
fr: Entier invalide

source: Invalid CLASS value
fr: Valeur CLASS invalide

source: Ignoring LEAP-SECOND directive
fr: Ignore directive LEAP-SECOND

source: Ignoring empty directive
fr: Ignore directive vide

source: Ignoring invalid directive - '%s'
fr: Ignore directive invalide - '%s'

source: Ignoring invalid directive
fr: Ignore directive invalide

source: Spurious '$' detected - ignoring
fr: Faux '$' détecté - ignoré

source: PROCESS statement ignored
fr: Instruction PROCESS ignorée

source: Dangling IF/ELSE directive
fr: Directive IF/ELSE dépareillée

source: Directive nest depth exceeded - %d
fr: Profondeur de Directive dépassée - %d

source: ELSE directive without matching IF/ELIF
fr: Directive ELSE sans IF/ELIF correspondant

source: END-IF directive without matching IF/ELIF/ELSE
fr: Directive END-IF sans IF/ELIF/ELSE correspondant

source: ELIF directive without matching IF/ELIF
fr: Directive ELIF sans IF/ELIF correspondant

source: Invalid internal case - %u
fr: Case interne invalide - %u

source: Buffer overrun - Literal too long - Aborting
fr: Dépassement de buffer (tampon) - Littéral trop long - Abandon

source: Line not terminated by a newline
fr: Ligne ne se terminant pas par un un caractère de fin de ligne

source: Source text after column %d
fr: Texte de source après la colonne %d

source: Invalid continuation in comment entry
fr: Continuation invalide dans l'entrée commentaire

source: Invalid indicator '%c' at column 7
fr: Indicateur '%c' invalide en colonne 7

source: Invalid line continuation
fr: Continuation de ligne invalide

source: Continuation character expected
fr: Caractère de continuation attendu

source: Directive comparison on different types
fr: Directive de comparaison sur types différents

source: Duplicate define
fr: Define dupliqué

source: Invalid constant
fr: Constante invalide

source: Invalid SOURCEFORMAT directive
fr: Directive SOURCEFORMAT invalide

source: Invalid FOLD-COPY-NAME directive
fr: Directive FOLD-COPY-NAME invalide

source: Invalid SOURCE directive
fr: Directive SOURCE invalide

source: Invalid DEFINE/SET directive
fr: Directive DEFINE/SET invalide

source: TURN directive not yet implemented
fr: Directive TURN pas encore implémenté

source: Invalid IF/ELIF directive
fr: Directive IF/ELIF invalide

source: Device name
fr: Nom de périphérique

source: Switch name
fr: Nom de switch

source: Feature name
fr: Caractéristique

source: Unknown
fr: Inconnu

source: '%s' reserved word, but not supported
fr: '%s' mot réservé, mais non supporté

source: Reserved Words Implemented (Y/N)
fr: Mots Réservés Implémenté (O/N)

source: Y (Context sensitive)
fr: O (sensible au contexte)

source: Y
fr: O

source: N (Context sensitive)
fr: N (sensible au contexte)

source: Extra (obsolete) context sensitive words
fr: Mots sensibles à l'Extra-contexte (obsolète)

source: Extra internal registers Definition
fr: Registres Extra-internes Définition

source: Intrinsic Function Implemented Parameters
fr: Fonctions intrinsèques Implémentées Paramètres

source: Mnemonic names
fr: Noms mnémoniques

source: Extended mnemonic names (with -fsyntax-extension)
fr: Noms mnémoniques étendus (avec -fsyntax-extension)

source: Word length exceeds 31 characters - '%s'
fr: Longueur de mot dépasse 31 caractères - '%s'

source: Word length exceeds maximum allowed - '%s'
fr: Longueur de mot dépasse le maximum autorisé - '%s'

source: A constant may not be used here - '%s'
fr: Une constante ne peut être utilisée ici - '%s'

source: Invalid symbol: %s - Skipping word
fr: Symbole invalide : %s - Mot non traité

source: Alphanumeric literal has zero length
fr: Le littéral alphanumérique a une longueur nulle

source: A SPACE will be assumed
fr: Un SPACE sera considéré comme présent

source: Invalid X literal: %s
fr: Littéral X invalide : %s

source: Invalid H literal: %s
fr: Littéral H invalide : %s

source: Invalid numeric literal
fr: Littéral numérique invalide

source: Invalid floating-point literal
fr: Littéral de nombre à virgule flottante invalide

source: Invalid CONSTANT - %s
fr: CONSTANT invalide - %s

source: Invalid alphanumeric CONSTANT - %s
fr: CONSTANT alphanumérique invalide - %s

source: Empty alphanumeric CONSTANT - %s
fr: CONSTANT alphanumérique vide - %s

source: Invalid numeric CONSTANT - %s
fr: CONSTANT numérique invalide - %s

source: %s clause is required for file '%s'
fr: Clause %s est requis pour le fichier '%s'

source: Internal error node
fr: Noeud d'erreur Interne

source: Unknown constant
fr: Constante inconnue

source: <Unexpected tree tag %d>
fr: <Etiquette d'arbre inattendue %d>

source: FUNCTION %s has invalid/not supported arguments - Tag %d
fr: FUNCTION %s contient des arguments invalides/non supportés - Etiquette %d

source: Unexpected cast type -> %d
fr: Transtypage inattendu -> %d

source: Unknown tree tag %d Category %d
fr: Etiquette d'arbre %d inconnue Catégorie %d

source: Unexpected numeric usage -> %d
fr: Utilisation d'une valeur numérique inattendue -> %d

source: Unexpected category -> %d
fr: Catégorie inattendue -> %d

source: Invalid literal cast - Aborting
fr: Transtypage de littéral invalide - Abandon

source: Numeric literal exceeds limit - Aborting
fr: Littéral numérique dépassant la limite - Abandon

source: Invalid LOCALE literal
fr: Littéral de localisation (LOCALE) invalide

source: Numeric field cannot be larger than %d digits
fr: Le champ numérique ne peut être plus grand que %d chiffres

source: Invalid picture string - '%s'
fr: Chaîne picture invalide - '%s'

source: ALTERNATE clause invalid for this file type
fr: Clause ALTERNATE invalide pour ce type de fichier

source: RECORD clause invalid for this file type
fr: Clause RECORD invalide pour ce type de fichier

source: ORGANIZATION clause invalid
fr: Clause ORGANIZATION invalide

source: Invalid KEY item '%s'
fr: Objet KEY invalide '%s'

source: Record size too small '%s'
fr: taille d'enregistrement trop petite '%s'

source: Record size too large '%s' (%d)
fr: Taille d'enregistrement trop grande '%s' (%d)

source: Record size exceeds maximum allowed (%d) - File '%s'
fr: Taille d'enregistrement excédant le maximum autorisé (%d) - Fichier '%s'

source: Invalid expression
fr: Expression invalide

source: Unexpected operator -> %d
fr: Opérateur inattendu -> %d

source: FUNCTION '%s' has invalid reference modification
fr: FUNCTION '%s' porte une 'reference modification' invalide

source: FUNCTION '%s' unknown
fr: FUNCTION '%s' inconnue

source: FUNCTION '%s' not implemented
fr: FUNCTION '%s' non implémentée

source: FUNCTION '%s' has wrong number of arguments
fr: FUNCTION '%s' a un nombre erroné d'arguments

source: FUNCTION '%s' can not have reference modification
fr: FUNCTION '%s' ne peut porter de 'reference modification'

source: FUNCTION '%s' has invalid parameter
fr: FUNCTION '%s' a un paramètre invalide

source: FUNCTION '%s' has invalid first parameter
fr: FUNCTION '%s' a un premier paramètre invalide

source: Invalid use of 88 level item
fr: Utilisation invalide d'objet de niveau 88

source: '%s' is not group name
fr: '%s' n'est pas un nom de groupe/structure

source: '%s' is not a numeric name
fr: '%s' n'est pas un nom de variable numérique

source: '%s' is not numeric or numeric-edited name
fr: '%s' n'est pas un nom de variable numérique, ni celui d'une variable numérique d'édition

source: '%s' is not a numeric value
fr: '%s' n'est pas une valeur numérique

source: '%s' is not an integer value
fr: '%s' n'est pas une valeur entière

source: A positive numeric integer is required here
fr: Un entier positif est requis ici

source: System routine Parameters
fr: Routine système Paramètres

source: ON/OFF usage requires a SWITCH name
fr: Syntaxe ON/OFF nécessite un nom de SWITCH

source: ASSIGN interpreted as %s
fr: ASSIGN interprété comme %s

source: Subscripts missing for '%s' - Defaulting to 1
fr: Indices manquant par '%s' - prende 1 par défaut

source: '%s' cannot be reference modified
fr: '%s' ne peut être 'reference modifié'

source: '%s' cannot be subscripted
fr: '%s' ne peut être indicé

source: '%s' requires 1 subscript
fr: '%s' nécessite 1 indice

source: '%s' requires %d subscripts
fr: '%s' nécessite %d indices

source: '%s' has no OCCURS clause
fr: '%s' ne comporte pas de clause OCCURS

source: Subscript of '%s' out of bounds: %d
fr: Indice de '%s' en dehors des bornes : %d

source: Offset of '%s' out of bounds: %d
fr: Position de '%s' en dehors des limites : %d

source: Length of '%s' out of bounds: %d
fr: Longueur de '%s' en dehors des limites : %d

source: Reference modification not allowed here
fr: Modification de référence non autorisée ici

source: ANY LENGTH item not allowed here
fr: Objet ANY LENGTH non autorisé ici

source: 88 level item not allowed here
fr: Objet de niveau 88 non autorisé ici

source: Variable length item not allowed here
fr: Objet de longueur variable non autorisé ici

source: '%s' is not an alphabet name
fr: '%s' n'est pas un nom d'alphabet

source: Duplicate character values in alphabet '%s'
fr: Valeurs de caractères dupliquées dans l'alphabet '%s'

source: Invalid character values in alphabet '%s'
fr: Valeurs de caractères invalides dans l'alphabet '%s'

source: Invalid ALPHABET name
fr: Nom d'ALPHABET invalide

source: Duplicate values in class '%s'
fr: Valeurs dupliquées dans la classe '%s'

source: '%s' is not a locale name
fr: '%s' n'est pas un nom de localisation (locale)

source: '%s' will be implicitly defined
fr: '%s' sera implicitement défini

source: ASSIGN data item '%s' invalid
fr: Objet de donnée ASSIGN '%s' invalide

source: '%s' ODO field item invalid here
fr: Objet de champ ODO '%s' invalide ici

source: '%s' cannot have OCCURS DEPENDING
fr: '%s' ne peut contenir OCCURS DEPENDING

source: '%s' ODO item must have GLOBAL attribute
fr: Objet ODO '%s' doit contenir l'attribut GLOBAL

source: RECORD DEPENDING item must be in WORKING/LOCAL/LINKAGE section
fr: Objet RECORD DEPENDING doit être dans une section WORKING/LOCAL/LINKAGE

source: Invalid RECORD DEPENDING item
fr: Objet RECORD DEPENDING invalide

source: '%s' is not in DECLARATIVES
fr: '%s' n'est pas dans la partie DECLARATIVES

source: Invalid reference to '%s' (In DECLARATIVES)
fr: Référence invalide à '%s' (Dans la partie DECLARATIVES)

source: '%s' not a procedure name
fr: '%s' n'est pas un nom de procédure

source: '%s' - DEBUGGING target invalid with ALL PROCEDURES
fr: '%s' - cible DEBUGGING invalide avec ALL PROCEDURES

source: '%s' - DEBUGGING target invalid
fr: '%s' - cible DEBUGGING invalide

source: '%s' is not a valid DEBUGGING target
fr: '%s' n'est pas une cible DEBUGGING valide

source: '%s' is not an alterable paragraph
fr: '%s' n'est pas un paragraphe modifiable

source: Suggest parentheses around AND within OR
fr: Suggère des parenthèses autour de AND aux alentours de OR

source: Internal decimal structure size exceeded - %d
fr: Taille pour structure décimale interne dépassée - %d

source: Unexpected operation %d
fr: Opération %d inattendue

source: Unexpected constant expansion
fr: Extension de constante inattendue

source: No CORRESPONDING items found
fr: Aucun objet CORRESPONDING trouvé

source: Invalid PROMPT literal
fr: Littéral PROMPT invalide

source: Invalid PROMPT identifier
fr: Identifiant de PROMPT invalide

source: Invalid input device '%s'
fr: Périphérique d'entrée '%s' invalide

source: '%s' is not defined in SPECIAL-NAMES
fr: '%s' n'est pas défini dans SPECIAL-NAMES

source: Target of ALLOCATE is not a BASED item
fr: La cible de ALLOCATE n'est pas un objet de type BASED

source: Target of RETURNING is not a data pointer
fr: La cible de RETURNING n'est pas un pointeur sur variable de donnée

source: The CHARACTERS field of ALLOCATE must be numeric
fr: Le champ CHARACTERS de ALLOCATE doit être numérique

source: INITIALIZED TO item is not alphanumeric
fr: Objet INITIALIZED TO n'est pas alphanumérique

source: Only alphanumeric FUNCTION types are allowed here
fr: Seulement des FUNCTION de type alphanumérique sont autorisées ici

source: Invalid RETURNING field
fr: Champ RETURNING invalide

source: STDCALL not available on this platform
fr: STDCALL n'est pas disponible sur cette plate-forme

source: STDCALL used on 64-bit Windows platform
fr: STDCALL utilisé sur des plate-formes Windows 64-bit

source: STATIC CALL convention requires a literal program name
fr: La convention STATIC CALL nécessite un nom de programme littéral

source: Numeric literal is negative
fr: Le littéral numérique est négatif

source: Figurative constant invalid here
fr: Constante figurative invalide ici

source: '%s' is not a valid data name
fr: '%s' n'est pas un nom de variable de donnée valide

source: '%s' ANY LENGTH item not passed BY REFERENCE
fr: Objet '%s' ANY LENGTH n'est pas passé BY REFERENCE

source: '%s' is not a 01 or 77 level item
fr: '%s' n'est pas un objet de niveau 01 ou 77

source: Wrong number of CALL parameters for '%s'
fr: Nombre incorrect de paramètres de CALL pour '%s'

source: '%s' is an invalid type for DISPLAY operand
fr: '%s' n'est pas un type valide pour l'opérande de DISPLAY

source: Invalid type for DISPLAY operand
fr: Type invalide pour l'opérande de DISPLAY

source: Invalid output device
fr: Périphérique de sortie invalide

source: '%s' is not an output device
fr: '%s' n'est pas un périphérique de sortie

source: Invalid use of 88 level in WHEN expression
fr: Utilisation invalide d'objet de niveau 88 dans une expression WHEN

source: Wrong number of WHEN parameters
fr: Nombre incorrect de paramètres WHEN

source: Target %d of FREE is not a BASED data item
fr: Cible %d de FREE n'est un objet de donnée de type BASED

source: Target %d of FREE must be a data pointer
fr: Cible %d de FREE doit être un pointeur sur une variable de donnée

source: GO TO with multiple procedure-names
fr: GO TO avec de multiples noms de procédure

source: %s operands differ in size
fr: Opérandes %s diffèrent en taille

source: Data name expected before CHARACTERS
fr: Nom de variable de donnée attendu avant CHARACTERS

source: Data name expected before ALL
fr: Nom de variable de donnée attendu avant ALL

source: Data name expected before LEADING
fr: Nom de variable de donnée attendu avant LEADING

source: Data name expected before TRAILING
fr: Nom de variable de donnée attendu avant TRAILING

source: ALL, LEADING or TRAILING expected before '%s'
fr: ALL, LEADING ou TRAILING attendu avant '%s'

source: Operand has wrong size
fr: L'operande a une taille erronée

source: Internal register '%s' defined as BINARY-LONG
fr: Registre interne '%s' défini comme BINARY-LONG

source: '%s' defined here as USAGE %s
fr: '%s' défini ici comme USAGE %s

source: '%s' defined here as USAGE FLOAT
fr: '%s' défini ici comme USAGE FLOAT

source: '%s' defined here as USAGE DOUBLE
fr: '%s' défini ici comme USAGE DOUBLE

source: '%s' defined here as USAGE FLOAT EXTENDED
fr: '%s' défini ici comme USAGE FLOAT EXTENDED

source: '%s' defined here as USAGE FLOAT-BINARY-7
fr: '%s' défini ici comme USAGE FLOAT-BINARY-7

source: '%s' defined here as USAGE FLOAT-BINARY-16
fr: '%s' défini ici comme USAGE FLOAT-BINARY-16

source: '%s' defined here as USAGE FLOAT-BINARY-34
fr: '%s' défini ici comme USAGE FLOAT-BINARY-34

source: '%s' defined here as USAGE FLOAT-DECIMAL-16
fr: '%s' défini ici comme USAGE FLOAT-DECIMAL-16

source: '%s' defined here as USAGE FLOAT-DECIMAL-34
fr: '%s' défini ici comme USAGE FLOAT-DECIMAL-34

source: '%s' defined here as PIC %s
fr: '%s' défini ici comme PIC %s

source: '%s' defined here as a group of length %d
fr: '%s' défini ici comme un groupe/structure de longueur %d
