Repository: ayumin/open-cobol
Catalog: po/*.po
Languages: fr

source: Invalid %s parameter
fr: Paramètre %s invalide

source: Too many errors - Aborting compilation
fr: Trop d'erreurs - Abandon de la compilation

source: %s:%d Internal compiler error
fr: %s:%d Erreur interne du compilateur

source: %s:%d Invalid cast from '%s' type %s to type %s
fr: %s:%d Transtypage invalide pour '%s' du type %s vers le type %s

source: Cannot allocate %d bytes of memory - Aborting
fr: Impossible d'allouer %d octets de mémoire - Abandon

source: Call to %s with NULL pointer
fr: Appel à %s avec un pointeur NULL

source: Cannot reallocate %d bytes of memory - Aborting
fr: Impossible de réallouer %d octets de mémoire - Abandon

source: Attempt to reallocate non-allocated memory - Aborting
fr: Tentative de réallocation de mémoire non allouée - Abandon

source: Warning - Assuming literal for unquoted '%s'
fr: Avertissement - '%s' sans guillemet considéré comme littéral

source: - Length is < 1 or > 31
fr: - La longueur est < 1 ou > 31

source: - Name cannot begin with space or underscore
fr: - Un nom ne peut commencer ni par espace, ni par le caractère souligné

source: - Name cannot begin with 'cob_' or 'COB_'
fr: - Un nom ne peut commencer par 'cob_' or 'COB_'

source: - Name duplicates a 'C' keyword
fr: - Un nom utilise un mot réservé du langage 'C'

source: - Name cannot contain a directory separator
fr: - Un nom ne peut contenir un caractère de séparation de répertoire

source: Invalid file base name '%s'%s
fr: Nom de base de fichier invalide '%s'%s

source: Invalid ENTRY '%s'%s
fr: ENTRY '%s'%s invalide

source: Invalid PROGRAM-ID '%s'%s
fr: PROGRAM-ID '%s'%s invalide

source: Unknown name error '%s'%s
fr: Erreur de nom inconnue '%s'%s

source: Error:
fr: Erreur :

source: Duplicate define '%s' - Ignoring
fr: Define '%s' doublonné - Ignoré

source: Parameter buffer size exceeded
fr: Taille de buffer de paramètre dépassée

source: Warning - Could not move temporary file to %s
fr: Avertissement - Impossible de transformer le fichier temporaire en %s

source: Aborting compile of %s at line %d
fr: Abandon de la compilation de %s à la ligne %d

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
fr: Cet un logiciel libre ; merci de regarder les fichiers sources pour les conditions de copie. Il n'y a AUCUNE garantie ; même en cas de COMMERCIALISATION ou D'ADAPTATION POUR UN USAGE PARTICULIER.

source: Built %s
fr: Fabriqué %s

source: Packaged %s
fr: Empaqueté %s

source: Executing:
fr: Exécute :

source: Build information
fr: Information de fabrication

source: Build environment
fr: Environnement de fabrication

source: Dynamic loading
fr: Chargement dynamique

source: System
fr: Système

source: Enabled
fr: Activé

source: Disabled
fr: Désactivé

source: Variable format
fr: Format variable

source: 8 bytes
fr: 8 octets

source: 4 bytes
fr: 4 octets

source: Sequential handler
fr: Gestionnaire de fichiers séquentiels

source: External
fr: Externe

source: Internal
fr: Interne

source: ISAM handler
fr: Gestionnaire de fichiers ISAM

source: C-ISAM (Experimental)
fr: C-ISAM (Expérimental)

source: D-ISAM (Experimental)
fr: D-ISAM (Expérimental)

source: VBISAM (Experimental)
fr: VBISAM (Expérimental)

source: - NOT set with -Wall
fr: - NON positionné avec -Wall

source: Usage: cobc [options] file ...
fr: Syntaxe : cobc [options] fichier ...

source: -help Display this message
fr: -help Affiche ce message

source: -version, -V Display compiler version
fr: -version, -V Affiche la version du compilateur

source: -v Display the commands invoked by the compiler
fr: -v Affiche les commandes invoquées par le compilateur

source: -x Build an executable program
fr: -x Fabrique un programme exécutable

source: -m Build a dynamically loadable module (default)
fr: -m Fabrique un module chargeable dynamiquement (mode par défaut)

source: -std=<dialect> Warnings/features for a specific dialect :
fr: -std=<dialecte> Avertissements/caractéristiques pour un dialecte spécifique :

source: ibm IBM Compatible
fr: ibm Compatible IBM

source: mvs MVS Compatible
fr: mvs Compatible MVS

source: bs2000 BS2000 Compatible
fr: bs2000 Compatible BS2000

source: mf Micro Focus Compatible
fr: mf Compatible Micro Focus

source: default When not specified
fr: default Lorsque non spécifié

source: See config/default.conf and config/*.conf
fr: Voir config/default.conf et config/*.conf

source: -free Use free source format
fr: -free Traite les fichiers source au format libre (free)

source: -fixed Use fixed source format (default)
fr: -fixed Traite les fichiers source au format fixe (fixed) (valeur par défaut)

source: -O, -O2, -Os Enable optimization
fr: -O, -O2, -Os Optimisation activée

source: -g Enable C compiler debug / stack check / trace
fr: -g Active la trace/la vérification de la pile/le déboggage compilateur C

source: -debug Enable all run-time error checking
fr: -debug Active la vérification de toutes les erreurs survenant pendant l'exécution (run-time)

source: -o <file> Place the output into <file>
fr: -o <fichier> Génère le fichier <fichier>

source: -b Combine all input files into a single
fr: -b Combine tous les fichiers en entrée en un seul

source: dynamically loadable module
fr: module chargeable dynamiquement

source: -E Preprocess only; do not compile or link
fr: -E Pré-traitement seulement ; pas de compilation, ni d'édition de liens

source: -C Translation only; convert COBOL to C
fr: -C Traduction seulement; converti le COBOL en C

source: -S Compile only; output assembly file
fr: -S Compilation seulement ; génère un fichier assembleur

source: -c Compile and assemble, but do not link
fr: -c Compile et assemble, sans édition de liens

source: -P(=<dir or file>) Generate preprocessed program listing (.lst)
fr: -P(=<rép ou fichier>) Génère un listing de programme pre-traité (.lst)

source: -Xref Generate cross reference through 'cobxref'
fr: -Xref Génère des références croisées via 'cobxref'

source: (V. Coen's 'cobxref' must be in path)
fr: (V. Coen's 'cobxref' doit être dans "path")

source: -I <directory> Add <directory> to copy/include search path
fr: -I <répertoire> Ajoute <répertoire> aux chemins de recherches des copy/include

source: -L <directory> Add <directory> to library search path
fr: -L <répertoire> Ajoute <répertoire> aux chemins de recherches des bibliothèques (library)

source: -l <lib> Link the library <lib>
fr: -l <lib> Edition de liens avec la bibliothèque <lib>

source: -A <options> Add <options> to the C compile phase
fr: -A <options> Ajoute <options> à la phase de compilation C

source: -Q <options> Add <options> to the C link phase
fr: -Q <options> Ajoute <options> à la phase d'éditions de liens C

source: -D <define> DEFINE <define> to the COBOL compiler
fr: -D <define> Ajoute la définition (DEFINE) <define> au compilateur COBOL

source: -K <entry> Generate CALL to <entry> as static
fr: -K <point d'entrée> Génère les appels (CALL) à <point d'entrée> comme statique

source: -conf=<file> User defined dialect configuration - See -std=
fr: -conf=<fichier> Dialecte défini par l'utilisateur - voir -std=

source: -list-reserved Display reserved words
fr: -list-reserved Affiche la lista des mots réservés

source: -list-intrinsics Display intrinsic functions
fr: -list-intrinsics Affiche la liste des fonctions intrinsèques (intrinsic functions)

source: -list-mnemonics Display mnemonic names
fr: -list-mnemonics Affiche la liste des mnémoniques

source: -list-system Display system routines
fr: -list-system Affiche la liste des routines système

source: -save-temps(=<dir>) Save intermediate files
fr: -save-temps(=<rép>) Conserve les fichiers intermédiaires

source: - Default : current directory
fr: - Default : répertoire courant

source: -ext <extension> Add default file extension
fr: -ext <extension> Ajoute l'extension de fichier par défaut

source: -W Enable ALL warnings
fr: -W Active TOUS les avertissements

source: -Wall Enable all warnings except as noted below
fr: -Wall Active tous les avertissements sauf ceux notés ci-dessous

source: Only one of options %s may be specified
fr: Seulement l'une des options %s peut être spécifiée

source: '%s' is not an intrinsic function
fr: '%s' n'est pas une fonction intrinsèque (intrinsic function)

source: Invalid output file name
fr: Nom de fichier en sortie invalide

source: Invalid option -std=%s
fr: Option -std=%s invalide

source: Warning - '%s' is not a directory, defaulting to current directory
fr: Avertissement - '%s' n'est pas un répertoire, le répertoire par défaut est le répertoire courant

source: Warning - assuming '%s' is a DEFINE - did you intend to use -debug?
fr: Avertissement - suppose '%s' comme définition (DEFINE) - vouliez-vous utiliser -debug?

source: Invalid option detected
fr: option invalide détectée

source: Failed to load the initial config file
fr: Echec de chargement du fichier de configuration initiale

source: Invalid tab-width value - %d
fr: Valeur de longueur de tabulation invalide - %d

source: Invalid text-column value - %d
fr: Valeur de colonne texte invalide - %d

source: Invalid file name parameter
fr: Paramètre de nom de fichier invalide

source: Unknown option ignored: %s
fr: Option inconnue ignorée: %s

source: Return status:
fr: Statut retourné :

source: Preprocessing:
fr: Pré-traitement :

source: 'cobxref' execution unsuccessful
fr: 'cobxref' exécution échouée

source: Check that 'cobxref' is in %s
fr: Vérifier que 'cobxref' est dans %s

source: No listing produced
fr: Aucun listing produit

source: Parsing:
fr: En cours d'analyse :

source: Translating:
fr: En cours de traduction :

source: No input files
fr: Aucun fichier en entrée

source: -o option invalid in this combination
fr: option -o invalide dans cette combinaison

source: Command line:
fr: Ligne de commande:

source: Unexpected CONSTANT item
fr: Objet CONSTANT inattendu

source: Unexpected tree tag %d
fr: Etiquette d'arbre inattendue %d

source: Unexpected cast type %d
fr: Type de transtypage %d inattendu

source: Internal statement stack depth exceeded -> %d
fr: Profondeur de pile d'instructions interne dépassée -> %d

source: Unexpected function %s
fr: fonction %s inattendue

source: Unexpected constant
fr: Constante inattendue

source: Unexpected tree category %d
fr: Catégorie d'arbre inattendue %d

source: Unexpected size
fr: Taille inattendue

source: Unexpected error_node parameter
fr: Paramètre error_node inattendu

source: Unexpected tree type %d
fr: Type d'arbre inattendu %d

source: Unexpected optimization value
fr: Valeur d'optimisation inattendue

source: Invalid value for '%s'
fr: Valeur invalide pour '%s'

source: '%s' not supported
fr: '%s' non supporté

source: No such file or directory
fr: Fichier ou répertoire inexistant

source: Invalid line
fr: Ligne invalide

source: Unknown tag '%s'
fr: Etiquette '%s' inconnue

source: Invalid type for '%s'
fr: Type invalide pour '%s'

source: %s: No definition of '%s'
fr: %s: Aucune définition de '%s'

source: In section
fr: Dans la section

source: In paragraph
fr: Dans le paragraphe

source: Warning:
fr: Avertissement :

source: %s is archaic in %s
fr: %s est archaïque dans %s

source: %s is obsolete in %s
fr: %s est obsolète dans %s

source: %s ignored
fr: %s ignoré

source: %s does not conform to %s
fr: %s n'est pas conforme à %s

source: Redefinition of '%s'
fr: Redéfinition de '%s'

source: '%s' previously defined here
fr: '%s' précédemment défini ici

source: %s is not defined
fr: %s n'est pas défini

source: %s ambiguous; need qualification
fr: %s ambigu ; besoin de qualification

source: defined here
fr: défini ici

source: Group item '%s' cannot have %s clause
fr: Objet Group/structure '%s' ne peut avoir la clause %s

source: Constant item '%s' cannot have a %s clause
fr: Objet constante '%s' ne peut avoir la clause %s

source: Level %02d item '%s' cannot have a %s clause
fr: Objet de niveau %02d '%s' ne peut avoir la clause %s

source: Constant item '%s' requires a %s clause
fr: Objet constante '%s' nécessite une clause %s

source: Level %02d item '%s' requires a %s clause
fr: Objet de niveau %02d '%s' nécessite une clause %s

source: Constant item '%s' can only have a %s clause
fr: Objet constante '%s' ne peut avoir qu'une clause %s

source: Level %02d item '%s' can only have a %s clause
fr: Objet de niveau %02d '%s' ne peut avoir qu'une clause %s

source: Invalid level number '%s'
fr: Niveau '%s' invalide

source: Level number must begin with 01 or 77
fr: Niveau doit commencer par 01 ou 77

source: No previous data item of level %02d
fr: Objet de données/champ de niveau %02d manquant

source: '%s' cannot be qualified here
fr: '%s' ne peut être qualifié ici

source: '%s' cannot be subscripted here
fr: '%s' ne peut être indicé ici

source: '%s' is not defined in '%s'
fr: '%s' n'est pas défini dans '%s'

source: Level number of REDEFINES entries must be identical
fr: Le niveau des entrées/champs REDEFINES doit être identique

source: Level number of REDEFINES entry cannot be 66 or 88
fr: Le niveau de l'entrée/champ REDEFINES ne peut être ni 66, ni 88

source: '%s' not the original definition
fr: '%s' n'est pas la définition originale

source: BLANK ZERO not compatible with USAGE
fr: BLANK ZERO non compatible avec USAGE

source: SIGN clause not compatible with USAGE
fr: Clause SIGN non compatible avec USAGE

source: PICTURE clause required for '%s'
fr: Clause PICTURE nécessaire pour '%s'

source: A non-numeric literal is expected for '%s'
fr: Un littéral non numérique est attendu pour '%s'

source: Defining implicit picture size %d for '%s'
fr: Défini implicitement la taille picture %d pour '%s'

source: '%s' ANY LENGTH only allowed in LINKAGE
fr: '%s' ANY LENGTH seulement autorisé pour LINKAGE

source: '%s' ANY LENGTH must be 01 level
fr: '%s' ANY LENGTH doit être de niveau 01

source: '%s' ANY LENGTH can not be BASED/EXTERNAL
fr: '%s' ANY LENGTH ne peut être BASED/EXTERNAL

source: '%s' ANY LENGTH has invalid definition
fr: '%s' ANY LENGTH a une définition invalide

source: '%s' ANY LENGTH must have a PICTURE
fr: '%s' ANY LENGTH doit avoir une PICTURE

source: '%s' 77 level not allowed here
fr: Objet de niveau 77 '%s' non autorisé ici

source: '%s' EXTERNAL must be specified at 01/77 level
fr: '%s' EXTERNAL doit être specifié au niveau 01/77

source: '%s' EXTERNAL can only be specified in WORKING-STORAGE section
fr: '%s' EXTERNAL peut être specifié dans une section WORKING-STORAGE

source: '%s' EXTERNAL and BASED are mutually exclusive
fr: '%s' EXTERNAL et BASED sont mutuellement exclusif

source: '%s' EXTERNAL not allowed with REDEFINES
fr: '%s' EXTERNAL non autorisé avec REDEFINES

source: '%s' BASED not allowed here
fr: '%s' BASED non autorisé ici

source: '%s' BASED not allowed with REDEFINES
fr: '%s' BASED non autorisé avec REDEFINES

source: '%s' BASED only allowed at the 01 and 77 levels
fr: '%s' BASED seulement autorisé aux niveaux 01 et 77

source: '%s' cannot have the OCCURS clause due to '%s'
fr: '%s' ne peut avoir la clause OCCURS à cause de '%s'

source: The original definition '%s' should not have OCCURS
fr: La définition originale '%s' ne devrait pas contenir OCCURS

source: REDEFINES must follow the original definition
fr: REDEFINES doit immédiatement suivre la définition originale

source: '%s' cannot be variable length
fr: '%s' ne peut être de longueur variable

source: The original definition '%s' cannot be variable length
fr: La définition originale '%s' ne peut être de longueur variable

source: SCREEN group item '%s' has invalid clause
fr: Objet de groupe/structure SCREEN '%s' contient une clause invalide

source: '%s' cannot have PICTURE clause
fr: '%s' ne peut contenir de clause PICTURE

source: '%s' PICTURE clause not compatible with USAGE
fr: La clause PICTURE '%s' est incompatible avec USAGE

source: '%s' COMP-6 with sign - Changing to COMP-3
fr: '%s' COMP-6 avec signe - Changé en COMP-3

source: '%s' cannot have JUSTIFIED RIGHT
fr: '%s' ne peut contenir JUSTIFIED RIGHT

source: '%s' cannot have BLANK WHEN ZERO
fr: '%s' ne peut contenir BLANK WHEN ZERO

source: Only level 88 item may have multiple values
fr: Seuls les objets de niveau 88 peuvent avoir des valeurs multiples

source: Entries under REDEFINES cannot have a VALUE clause
fr: Les entrées/champs sous REDEFINES ne peuvent contenir de clause VALUE

source: Initial VALUE clause ignored for EXTERNAL item
fr: Clause VALUE initiale ignorée pour objet EXTERNAL

source: Ignoring SYNCHRONIZED for group item '%s'
fr: Ignoré SYNCHRONIZED pour la structure '%s'

source: Size of '%s' larger than size of '%s'
fr: Taille de '%s' plus grand que la taille de '%s'

source: '%s' binary field cannot be larger than %d digits
fr: Champ binaire '%s' ne peut être plus grand que %d chiffres

source: Literal type does not match data type
fr: Le type du littéral ne correspond pas au type de données

source: Define PERFORM stack size - Default : 255
fr: Définir la taille de pile PERFORM - Valeur par défaut : 255

source: Define cutoff depth for IF statements - Default : 3
fr: Définir la profondeur d'arrêt pour les instructions IF - Valeur par défaut : 3

source: Define display sign representation - ASCII or EBCDIC (Default : machine native)
fr: Définir la représentation d'affichage - ASCII or EBCDIC (Valeur par défaut : dépendant de la machine)

source: Fold COPY subject to value - UPPER or LOWER (Default : no transformation)
fr: Adapte le sujet COPY à la valeur - UPPER or LOWER (Valeur par défaut : pas de transformation)

source: Fold PROGRAM-ID, CALL, CANCEL subject to value - UPPER or LOWER (Default : no transformation)
fr: Adapte le sujet PROGRAM-ID, CALL, CANCEL à la valeur - UPPER or LOWER (Valeur par défaut : pas de transformation)

source: Initialize fields without VALUE to decimal value - 0 to 255 (Default : initialize to picture)
fr: Initialise les champs sans VALUE à une valeur décimale - 0 à 255 (Par défaut : initialise à la valeur picture)

source: Intrinsics to be used without FUNCTION keyword - ALL or intrinsic function name (,name,...)
fr: fonctions intrinsèques (Intrinsics) à utiliser sans le mot-clé FUNCTION - ALL ou nom de fonction intrinsèque (,nom,...)

source: Output static function calls for the CALL statement
fr: Génère des appels de fonction statiques pour l'instruction CALL

source: Generate computed goto C statements
fr: Génère des instructions C goto calculées

source: Use restricted ASCII to EBCDIC translate
fr: Utilise une traduction restreinte ASCII vers EBCDIC

source: Generate extra braces in generated C code
fr: Génère des accolades supplémentaires dans le code C généré

source: Attempt correction of invalid numeric display items
fr: Tentative de correction d'objets d'affichage/à afficher numériques invalides

source: PERFORM stack allocated on heap
fr: Pile PERFORM allouée sur le tas

source: Generate trace code - Executed SECTION/PARAGRAPH
fr: Génère du code pour trace - SECTION/PARAGRAPH exécuté

source: Generate trace code - Executed SECTION/PARAGRAPH/STATEMENTS - Turned on by -debug
fr: Génère du code pour trace - SECTION/PARAGRAPH/STATEMENTS exécuté - Activé par -debug

source: Syntax error checking only; don't emit any output
fr: Seulement vérification des erreurs de syntaxe en mode silencieux

source: Enable debugging lines - 'D' in indicator column or floating >>D
fr: Autorise le débogage des lignes - D en colonne indicateur ou motif flottant >>D

source: Generate source location code - Turned on by -debug/-g/-ftraceall
fr: Génère du code de localisation de source - Activé par -debug/-g/-ftraceall

source: Automatic initialization of the Cobol runtime system
fr: Initialisation automatique du système d'exécution (runtime) Cobol

source: PERFORM stack checking - Turned on by -debug or -g
fr: Vérification de la pile PERFORM - Activé par -debug or -g

source: Allow syntax extensions - eg. Switch name SW1, etc.
fr: Autorise les extensions de syntaxe - ex. Switch name SW1, etc.

source: Use AFTER 1 for WRITE of LINE SEQUENTIAL - Default : BEFORE 1
fr: Utilise AFTER 1 pour instruction WRITE sur flux type LINE SEQUENTIAL - Valeur par défaut : BEFORE 1

source: '*' or '/' in column 1 treated as comment - FIXED format only
fr: '*' ou '/' en colonne 1, ligne traitée comme commentaire - format fixe (FIXED) seulement

source: Allow numeric field overflow - Non-ANSI behaviour
fr: Autorise le débordement sur champ numérique - Comportement non-ANSI

source: Adjust items following OCCURS DEPENDING - Requires implicit/explicit relaxed syntax
fr: Ajuste les objets suivant OCCURS DEPENDING - Nécessite la déclaration implicite/explicite de syntaxe assouplie

source: Use a single quote (apostrophe) for QUOTE - Default : double quote
fr: Utilise un guillemet simple (apostrophe) pour QUOTE - Valeur par défaut : guillemet

source: Check recursive program call
fr: Vérifie les appels de programmes récursifs

source: Relax syntax checking - eg. REDEFINES position
fr: Vérification de syntaxe assouplie - ex. emplacement de REDEFINES

source: Treat all files as OPTIONAL - unless NOT OPTIONAL specified
fr: Traite tous les fichiers comme OPTIONAL - A moins que NOT OPTIONAL soit spécifié

source: '%s' not implemented
fr: '%s' non implémenté

source: Unreachable statement '%s'
fr: Instruction inaccessible '%s'

source: '%s' not level 01 or 77
fr: '%s' n'est pas de niveau 01, ni 77

source: '%s' is not in LINKAGE SECTION
fr: '%s' n'est pas dans LINKAGE SECTION

source: '%s' can not be BASED/EXTERNAL
fr: '%s' ne peut être BASED/EXTERNAL

source: '%s' is not in WORKING-STORAGE SECTION
fr: '%s' n'est pas dans WORKING-STORAGE SECTION

source: '%s' REDEFINES field not allowed here
fr: Champ '%s' REDEFINES non autorisé ici

source: LINKAGE item '%s' is not a PROCEDURE USING parameter
fr: Objet LINKAGE '%s' n'est pas un paramètre de PROCEDURE USING

source: '%s' USING item duplicates RETURNING item
fr: L'objet '%s' USING est dupliqué dans l'objet RETURNING

source: ENTRY '%s' duplicated
fr: Point d'entrée (ENTRY) '%s' doublonnée

source: Maximum nested program depth exceeded (%d)
fr: Profondeur des sous-programmes (nested program) dépassée (%d)

source: %s statement not terminated by END-%s
fr: Instruction %s non terminée par END-%s

source: USE statement invalid for SORT file
fr: Instruction USE invalide pour SORT sur fichier

source: Duplicate %s clause
fr: Clause %s doublonnée

source: %s header missing - assumed
fr: Entête %s manquant - assumé

source: %s header missing
fr: Entête %s manquant

source: Multiple PROGRAM-ID's without matching END PROGRAM
fr: Multiple PROGRAM-ID's sans END PROGRAM apparié

source: Executable requested but no program found
fr: Exécutable demandé mais aucun programme trouvé

source: END PROGRAM '%s' is different to PROGRAM-ID '%s'
fr: END PROGRAM '%s' est différent de PROGRAM-ID '%s'

source: END FUNCTION '%s' is different to FUNCTION-ID '%s'
fr: END FUNCTION '%s' est différent de FUNCTION-ID '%s'

source: COMMON may only be used in a contained program
fr: COMMON ne peut être utilisé quand dans un sous-programme (contained program)

source: Phrases in non-standard order
fr: Phrases dans un ordre non standard

source: Duplicate CLASSIFICATION clause
fr: Clause CLASSIFICATION dupliquée

source: Invalid system-name '%s'
fr: Nom système '%s' invalide

source: Invalid CRT clause
fr: Clause CRT invalide

source: Invalid special names clause
fr: Clause de noms spéciaux invalide

source: Invalid SYMBOLIC clause
fr: Clause SYMBOLIC invalide

source: CLASS literal with THRU must have size 1
fr: Littéral CLASS avec THRU doit être de taille 1

source: Invalid currency sign '%s'
fr: Signe de monnaie '%s' invalide

source: RECORD description invalid with REPORT
fr: description de RECORD invalide avec REPORT

source: RECORD description missing or invalid
fr: description de RECORD manquante ou invalide
